[{"username": "Snapper", "date": "30 Mar 2020, 10:46", "content": "<strong>Introduction</strong><br/><br/>I’m sure many of you remember SkyDaz “hijacking” the thread about some other forummer’s loft conversion and how he amused and horrified us all with tales of his nightmare experience with builders, and plumbers, and of course bees.  <img alt=\":thumbup:\" class=\"smilies\" src=\"./images/smilies/icon_thumbsup.gif\" title=\"Thumb Up\"/> <br/><br/>I mentioned in that thread that I had my own bee-related tale of woe, but that I thought it best to let him finish telling us his story first, rather than have the thread go off on yet another tangent. <br/><br/>I had intended to go back and tell this story before now but to be honest I forgot all about it. However, like most of you, I’ve found myself with a bit more time on my hands this past week and I have decided to ignore all the useful stuff I could be doing (and which my wife has asked me to do), and instead I’m typing out this bee story for a bunch of strangers on the internet (which nobody has asked me to do). <br/><br/>Disclaimer at this stage: this is a long story and I am going to take my time telling it. There is a fair bit of background required before we even get to the bees. I was tempted not to bother explaining the background, but it’ll probably save a lengthy Q&amp;A in the long run. And it’s not like many of you have much else to be doing so maybe it will provide a welcome distraction. So if you don’t like long reads, now is the time to fuck off.<br/><br/>I’ll update the story in various stages (I’m currently writing Part 6 and I reckon it’s at least an 8 parter) over the next couple of days. And although I do have some photos which I will post, I don’t have as many as I would like from “before” (or “bee-fore” if you will, hahaha) so I have prepared a couple of MS Paint diagrams as well."}, {"username": "Snapper", "date": "30 Mar 2020, 10:47", "content": "<strong>Part 1 – I remember that summer in Dublin…</strong><br/><br/>In the long, hot summer of 2018, my wife and I sold our house in the leafy suburbs of South County Dublin. <br/><br/>We’d been talking about getting out of Dublin for a while, in search of a quieter life, but nothing was ever firmed up until my wife was offered a job in Cork. It was a good opportunity for her, so I told her to go for it. I spoke with my own work and they were desperate to keep me, so much so that they agreed to let me to stay on in my current role and work remotely 95% of the time. We put our house on the market and it sold within a few weeks, due to the latest Dublin housing market bubble. Hurray for greed! <br/><br/>And so it was in September 2018, that we packed up our entire lives into a mover’s truck and a rented Opel Vivaro, said goodbye to the house that had been our home for nearly a decade, and set off for Cork with our zero children and three dogs.<br/><br/>We first moved into a rented house, but we knew we needed to buy somewhere quickly. The rental was from a friend - it was her deceased brother’s house and being sold as soon as it went through probate. With 3 large dogs we were going to struggle to find another rented place that would take us. <br/><br/>So the plan was to buy somewhere, and we had been looking for the right place all summer. It was like an episode of Escape to the Country as we traipsed around rural Cork looking for the right place… well, it was like an episode of Escape to the Country where the searching couple aren’t a pair of old fuckers who you just know voted Leave.<br/><br/>Anyway, after a lengthy and at times frustrating search, we finally found the home of our dreams. We decided to buy an old mill. My wife fell in love with the gentle sound of the stream running beside it, and I fell in love with the idea of being able to leave social situations urgently simply by saying I needed to go as there was “trouble down the old mill”. <br/><br/>The purchase was agreed before we left Dublin, so we hoped to be renting for no more than a few weeks. But buying a mill ain’t easy, as the old saying goes. We had to do lots of surveys, speak to lots of people and make some solicitors very wealthy indeed."}, {"username": "CorneliusTBadger", "date": "30 Mar 2020, 10:48", "content": "Fuck 'em"}, {"username": "Ninjacuts", "date": "30 Mar 2020, 10:48", "content": "<img alt=\"Image\" class=\"postimage\" src=\"https://media3.giphy.com/media/fLDmnw9BGABGw/giphy.gif\"/>"}, {"username": "Geoff", "date": "30 Mar 2020, 10:50", "content": "'trouble at t'mill\" if you please<br/><br/>in"}, {"username": "Geoff", "date": "30 Mar 2020, 10:51", "content": "Also can I see pics of this mill. Love homes with character.  <img alt=\":toppa:\" class=\"smilies\" src=\"./images/smilies/5.gif\" title=\"Toppa\"/>"}, {"username": "chewie", "date": "30 Mar 2020, 10:52", "content": "Beads?"}, {"username": "drgecko", "date": "30 Mar 2020, 10:55", "content": "In before the bees"}, {"username": "Spanouse", "date": "30 Mar 2020, 10:56", "content": "Well the jokes have been taken, may aswell read the OP.  <img alt=\":sulk:\" class=\"smilies\" src=\"./images/smilies/1.gif\" title=\"Sulk\"/>"}, {"username": "CarTree", "date": "30 Mar 2020, 10:59", "content": "Glanced at the OP and thought \"that doesn't look too long\".<br/><br/>It's just the introduction ffs  <img alt=\":lol:\" class=\"smilies\" src=\"./images/smilies/icon_lol.gif\" title=\"lol\"/> <br/><br/>IN"}, {"username": "Snapper", "date": "30 Mar 2020, 11:01", "content": "<strong>Part 2 – Everything’s coming up Mill-house!</strong><br/><br/>The mill was originally built in the early 19th century, but it had been converted into a home in the late 1990s by the previous owners. In terms of a project, this meant that the heavy lifting in terms of knocking down walls, rewiring, plumbing etc had been taken care of relatively recently. At the same time, as most of that renovation work was done 20 years ago, it would still need a fair bit of work to modernise things and put our stamp on it.<br/><br/>Given that we didn’t have an awful lot of money left after the purchase and the moving costs, we drew up a long list of stuff that we would like to do with the place. We then estimated a price for each item and then prioritised in terms of what we felt was vital and what could wait. We ended up with an “urgent” list comprised of assorted electrical jobs around the house (eg replacing old sockets/light fittings, and installation of a new smoke alarm system), installation of a new floor and built-in wardrobes in the master bedroom as both were in poor nick, and refitting the en-suite bathroom completely, as it was in very poor nick. <br/><br/>The idea was that by getting this work done, we would have reassurance us that the electrical and fire safety systems were up to scratch throughout the house, and we would also bring the master bedroom and en-suite up to a good standard of finish/decor. The kitchen and living room were in good condition already, so we would then have the basics covered in terms of day-to-day living and could set about bringing the other rooms (spare bedrooms, dining room, main bathroom) up to the same standard over time.<br/><br/>Our purchase also included a small cottage on the property which was modernised about 5 years ago. This meant that we had the luxury of being able to move into the cottage while the different tradesmen worked on the mill. This was a godsend to be honest - anyone who has lived in a house where tradesmen are working will know how annoying and disruptive it can be.<br/><br/>In December 2018 after 3 months in the rented house, we finally took possession of the keys for the mill and the cottage… The timing meant that we got the keys the week before Christmas. With the Christmas break, nothing progressed with the work on the mill until early January and, as can often happen when there is no firm deadline in place, the work dragged on longer than it probably should have.<br/><br/>Things kept moving along at this leisurely pace until mid-February 2019, when a friend of ours suddenly found himself in need of a place to live for a few months. We offered him the cottage, thus lighting a fire under our arses in terms of urgency. We began to crack the whip a bit more with the various tradesmen, having agreed with our friend that he could have the cottage from mid-March 2019.<br/><br/>This is relevant partly because it explains why we owned the mill for 3 months before we spent any significant time in there. We were in and out to check on things, take measurements, meet tradesmen etc… but never for much more than half an hour at a time, and never in any one room for more than a few minutes. <br/><br/>In hindsight, I suppose I did notice that there were sometimes a few dead bees around the windows in the master bedroom, probably more than you would expect... but I didn’t think too much about it with everything else that was going on. Fuck em, I thought to myself, they’re only bees."}, {"username": "Satisfied Fool", "date": "30 Mar 2020, 11:11", "content": "The bees have arrived."}, {"username": "Snapper", "date": "30 Mar 2020, 11:12", "content": "<strong>Part 3 – Beads??? </strong><br/><br/>The next thing to point out is that a 19th century mill would obviously not have been originally built with any central heating, indoor plumbing or electrics in mind. The external walls are approximately 3 foot thick and constructed from solid masonry using whatever stones were to hand at the time… so when the previous owners set about retro-fitting these systems, they decided not to attempt to recess pipes and electrical cabling etc into the existing external walls. <br/><br/>Instead, in some rooms they installed plasterboard surrounds running along the wall, and come to just under window level. At the bottom of these surrounds, they boxed in electrical cables for wall sockets and plumbing pipes for central heating and bathroom supply and waste. Above this, they had installed the radiators with appropriate space allowed so that the rads are exposed.<br/><br/>I am conscious that I am probably explaining this terribly so have prepared some MS paint diagrams of the setup in the master bedroom which will hopefully make it clear.<br/><br/>This was the basic set-up as you looked at it:<br/><br/><img alt=\"Image\" class=\"postimage\" src=\"https://i.imgur.com/ZMTYb8p.jpg\"/><br/><br/>And this is how it would look as a cross-section:<br/><br/><img alt=\"Image\" class=\"postimage\" src=\"https://i.imgur.com/cnJxUrl.jpg\"/><br/><br/>As you can hopefully see, the radiators were exposed and although the surround was built around them, there was a gap around the rads where you could, if inclined, reach a hand in and touch the inside of the external wall behind them, which had been finished with plasterwork. <br/><br/>In early March 2019 we had our electrician come to spend a couple of days taking care of the electrical jobs. We’d already had the floorers, the bathroom guys and the wardrobe installers come and go, working almost exclusively in the master bedroom, and none had expressed any concerns about bees. But when the electrician went to replace one of the plug sockets in the master bedroom, in his words “a load of fucking bees” came out of the void between the surround and the external wall as soon as he removed the old socket.<br/><br/>Now I am conscious that the words “a load of fucking bees” means different things to different people, so I pressed him further. It turns out that there were around 15 or 20. He said that they began crawling out – not flying – and that they were sluggish and slow moving. He had he let them all come out and fall to the floor. A diligent and dedicated worker, he had simply brushed them to one side and finished his work. He only told me about it when he was finishing up that evening. So I went to have a look and found that they most of them had since managed to crawl up the wall and onto the windowsill, where some had sadly perished and others were gamely clinging on to life, but were clearly not long for this world.<br/><br/>Now this development disturbed me somewhat – it seemed obvious that there was some sort of bee community - a hive if you will - hidden somewhere in the wall. I'm pretty sharp, you see. So I got onto Google to see what I could find out… and discovered that my options were rather limited. <br/><br/>I once had a wasp’s nest in the attic of my old house and an exterminator came and promptly laid the smack down on those yellow bastards with some chemicals. But bees are a different story. In Ireland (and I’m guessing it’s probably the same for the UK) they’re protected so you’re not supposed to kill them if you find a hive. Instead you should contact the Irish Beekeeper’s Association who will put you in touch with a local beekeeper who will come out and remove the hive. <br/><br/>Fair enough, the little bastards give us honey and pollinate plants and so forth, so I guess they deserve some protection."}, {"username": "Snapper", "date": "30 Mar 2020, 11:15", "content": "That's all for today, hopefully there's enough to keep you cretins satisfied for now.<br/><br/>I'll do parts 4 to 6 tomorrow and probably finish things off on Wednesday, although as I said, I am still writing this and it will BEE as long as it needs to BEE.  <img alt=\":smug:\" class=\"smilies\" src=\"./images/smilies/icon_smug.gif\" title=\"Smug\"/> <br/><br/>I'll try get around to posting some general photos of the house for you Geoff, and yes I am aware of all of the bee jokes and have relied upon most of them in the course of my story.<br/><br/> <img alt=\":toppa:\" class=\"smilies\" src=\"./images/smilies/5.gif\" title=\"Toppa\"/>"}, {"username": "cooks-looking", "date": "30 Mar 2020, 11:17", "content": "He's been playing you the bee side!"}, {"username": "Smith 9", "date": "30 Mar 2020, 11:21", "content": "<blockquote><div><cite>Snapper wrote:</cite>I once had a wasp’s nest in the attic of my old house and an exterminator came and promptly laid the smack down on those yellow bastards with some chemicals.</div></blockquote><br/><br/> <img alt=\":lol:\" class=\"smilies\" src=\"./images/smilies/icon_lol.gif\" title=\"lol\"/> <br/><br/>I actually have the pleasure of bumble bees in my house every year, guess they must nest in the attic somewhere. Aside from the frantic buzzing noise when trapped behind a window, they're no problem at all. Quite endearing <img alt=\":nod:\" class=\"smilies\" src=\"./images/smilies/icon_nod.gif\" title=\"Nod\"/>"}, {"username": "RickoShay", "date": "30 Mar 2020, 11:23", "content": "<blockquote><div><cite>drgecko wrote:</cite>In before the bees</div></blockquote><br/><br/>Not the bees!!!!!<br/><br/>In"}, {"username": "Lad O'Banter", "date": "30 Mar 2020, 11:24", "content": "good stuff, bm - post pictures of the wife, too, please"}, {"username": "OperationGoodisonExercise", "date": "30 Mar 2020, 11:26", "content": "This has potential to bee an interesting thread."}, {"username": "Geoff", "date": "30 Mar 2020, 11:32", "content": "<blockquote><div><cite>Snapper wrote:</cite> <br/><br/>I'll try get around to posting some general photos of the house for you Geoff,<br/><br/> <img alt=\":toppa:\" class=\"smilies\" src=\"./images/smilies/5.gif\" title=\"Toppa\"/></div></blockquote><br/><br/>Much obliged, mucker  <img alt=\":toppa:\" class=\"smilies\" src=\"./images/smilies/5.gif\" title=\"Toppa\"/> <br/><br/>We have a bee hive somewhere in one of our walls, fortunately they are outside facing so we just let them get on with.<br/><br/>Honey bees they be which, now that I think about it, means we must have load of delicious honeycomb inside my house somewhere  <img alt=\":shocked:\" class=\"smilies\" src=\"./images/smilies/icon_eek.gif\" title=\"Shocked\"/>"}, {"username": "lynbod", "date": "30 Mar 2020, 11:37", "content": "This is absolutely shit, and a prime example of someone thinking they are far funnier and more interesting than they actually are."}, {"username": "Godin", "date": "30 Mar 2020, 11:40", "content": "<img alt=\"Image\" class=\"postimage\" src=\"https://media.giphy.com/media/U5MozYUQYYTfy/giphy.gif\"/>"}, {"username": "CarTree", "date": "30 Mar 2020, 11:42", "content": "Surprising lack of bees in the MS paint picture, makes me think you're making a big fuss over nothing here."}, {"username": "Snapper", "date": "30 Mar 2020, 11:53", "content": "<blockquote><div><cite>lynbod wrote:</cite>This is absolutely shit, and a prime example of someone thinking they are far funnier and more interesting than they actually are.</div></blockquote><br/><br/>You're going to love the next few parts, where I really lay the thinking-I-am-far-funnier-and-more-interesting-than-I-actually-am on thick  <img alt=\":smug:\" class=\"smilies\" src=\"./images/smilies/icon_smug.gif\" title=\"Smug\"/>"}, {"username": "keikaku", "date": "30 Mar 2020, 12:14", "content": "In<br/><br/>Got fuck all else to do tbf"}, {"username": "Theposh11", "date": "30 Mar 2020, 12:48", "content": "In for sure."}, {"username": "Valencia", "date": "30 Mar 2020, 12:57", "content": "Bee mark  <img alt=\":thumbup:\" class=\"smilies\" src=\"./images/smilies/icon_thumbsup.gif\" title=\"Thumb Up\"/>"}, {"username": "Snapper", "date": "30 Mar 2020, 14:25", "content": "<blockquote><div><cite>Smith 9 wrote:</cite><blockquote><div><cite>Snapper wrote:</cite>I once had a wasp’s nest in the attic of my old house and an exterminator came and promptly laid the smack down on those yellow bastards with some chemicals.</div></blockquote><br/><br/> <img alt=\":lol:\" class=\"smilies\" src=\"./images/smilies/icon_lol.gif\" title=\"lol\"/> <br/><br/>I actually have the pleasure of bumble bees in my house every year, guess they must nest in the attic somewhere. Aside from the frantic buzzing noise when trapped behind a window, they're no problem at all. Quite endearing <img alt=\":nod:\" class=\"smilies\" src=\"./images/smilies/icon_nod.gif\" title=\"Nod\"/></div></blockquote><br/><br/>I wouldn't worry about bumblebees, their colonies are pretty small (maybe 50 or so bees). Honeybees are a different story, with many thousands of bees in each hive. As I was about to discover."}, {"username": "Rugs", "date": "30 Mar 2020, 14:32", "content": "Popped in to see why there was such a buzz about this thread"}, {"username": "humungojerry", "date": "30 Mar 2020, 14:43", "content": "the MS paint drawing is far too good, it’s like an Autocad diagram ffs"}, {"username": "Mujo", "date": "30 Mar 2020, 14:52", "content": "Could I <em>BEE</em> any more in  <img alt=\":o\" class=\"smilies\" src=\"./images/smilies/icon_surprised.gif\" title=\"Surprised\"/>"}, {"username": "Bingoa", "date": "30 Mar 2020, 15:03", "content": "Snapston.  <img alt=\":toppa:\" class=\"smilies\" src=\"./images/smilies/5.gif\" title=\"Toppa\"/> <br/><br/>Do like personal tales of woe tbph."}, {"username": "loggingin", "date": "30 Mar 2020, 15:31", "content": "BM  <img alt=\":toppa:\" class=\"smilies\" src=\"./images/smilies/5.gif\" title=\"Toppa\"/>"}, {"username": "Tommytonks", "date": "30 Mar 2020, 15:37", "content": "In these troubled times, this is exactly what we need (except Lynbod)"}, {"username": "Snapper", "date": "30 Mar 2020, 15:47", "content": "<blockquote><div><cite>humungojerry wrote:</cite>the MS paint drawing is far too good, it’s like an Autocad diagram ffs</div></blockquote><br/><br/>*notsureifseriousgif*"}, {"username": "Dire on tour", "date": "30 Mar 2020, 15:57", "content": "in for the shitty bee puns!"}, {"username": "Chester J Lampwick", "date": "30 Mar 2020, 16:02", "content": "Bee emm"}, {"username": "Quincy", "date": "30 Mar 2020, 16:38", "content": "Not sure what the problem is, sounds like the mill came with a Hive heating system already in place."}, {"username": "Ellis Carver", "date": "30 Mar 2020, 17:15", "content": "<blockquote><div><cite>Dire on tour wrote:</cite>in for the shitty bee puns!</div></blockquote><br/>There’s always someone looking to shoe hornet in"}, {"username": "humungojerry", "date": "30 Mar 2020, 17:39", "content": "<blockquote><div><cite>Snapper wrote:</cite><blockquote><div><cite>humungojerry wrote:</cite>the MS paint drawing is far too good, it’s like an Autocad diagram ffs</div></blockquote><br/><br/>*notsureifseriousgif*</div></blockquote><br/><br/>er, the usual forum ms paint diagram looks like it was drawn by a drunk, disabled 5 year old"}, {"username": "Reptile City", "date": "30 Mar 2020, 17:43", "content": "<blockquote><div><cite>Quincy wrote:</cite>Not sure what the problem is, sounds like the mill came with a Hive heating system already in place.</div></blockquote><br/><br/><br/> <img alt=\":lol:\" class=\"smilies\" src=\"./images/smilies/icon_lol.gif\" title=\"lol\"/><br/><br/>In af btw"}, {"username": "Ali Bongo", "date": "30 Mar 2020, 17:49", "content": "In."}, {"username": "Davos", "date": "30 Mar 2020, 18:23", "content": "Bee. M."}, {"username": "gostiky", "date": "30 Mar 2020, 19:15", "content": "Just popped in to see what the buzz is about"}, {"username": "Widdydank", "date": "30 Mar 2020, 19:16", "content": "<blockquote><div><cite>Quincy wrote:</cite>Not sure what the problem is, sounds like the mill came with a Hive heating system already in place.</div></blockquote><br/><br/> <img alt=\":lol:\" class=\"smilies\" src=\"./images/smilies/icon_lol.gif\" title=\"lol\"/> <img alt=\":picard:\" class=\"smilies\" src=\"./images/smilies/picard.gif\" title=\"Picard\"/> <img alt=\":thumbup:\" class=\"smilies\" src=\"./images/smilies/icon_thumbsup.gif\" title=\"Thumb Up\"/>"}, {"username": "CBlue", "date": "31 Mar 2020, 03:30", "content": "<blockquote><div><cite>lynbod wrote:</cite>This is absolutely shit, and a prime example of someone thinking they are far funnier and more interesting than they actually are.</div></blockquote><br/>U ok hun"}, {"username": "I am Webb.", "date": "31 Mar 2020, 03:45", "content": "<blockquote><div><cite>lynbod wrote:</cite>This is absolutely shit, and a prime example of someone thinking they are far funnier and more interesting than they actually are.</div></blockquote><br/><br/>sort of this. - Comedy is all about timing. you've just smashed through half your story in under a page, leave your audience wanting more.<br/><br/>I'm in like but ya, know, tease us a little bit."}, {"username": "Snapper", "date": "31 Mar 2020, 04:08", "content": "<blockquote><div><cite>I am Webb. wrote:</cite><blockquote><div><cite>lynbod wrote:</cite>This is absolutely shit, and a prime example of someone thinking they are far funnier and more interesting than they actually are.</div></blockquote><br/><br/>sort of this. - Comedy is all about timing. you've just smashed through half your story in under a page, leave your audience wanting more.<br/><br/>I'm in like but ya, know, tease us a little bit.</div></blockquote><br/><br/>Understood. <br/><br/>I won't provide any more updates for 2 to 3 months."}, {"username": "I am Webb.", "date": "31 Mar 2020, 04:11", "content": "<img alt=\":toppa:\" class=\"smilies\" src=\"./images/smilies/5.gif\" title=\"Toppa\"/>"}, {"username": "CarTree", "date": "31 Mar 2020, 04:16", "content": "Yeah, it would have been brilliant if he'd just told us that him and his girlfriend wanted to move from Dublin.  We'd have been on tender hooks, I'm sure  <img alt=\":uhoh:\" class=\"smilies\" src=\"./images/smilies/icon_uhoh.gif\" title=\"Uh oh\"/>"}, {"username": "Bingoa", "date": "31 Mar 2020, 04:25", "content": "<blockquote><div><cite>CarTree wrote:</cite>Yeah, it would have been brilliant if he'd just told us that him and his girlfriend wanted to move from Dublin.  We'd have been on tender hooks, I'm sure  <img alt=\":uhoh:\" class=\"smilies\" src=\"./images/smilies/icon_uhoh.gif\" title=\"Uh oh\"/></div></blockquote><br/>Exactly. <br/><br/>There’s nothing on here that some nobhead won’t moan about.  <img alt=\":picard:\" class=\"smilies\" src=\"./images/smilies/picard.gif\" title=\"Picard\"/>"}, {"username": "TheInformer", "date": "31 Mar 2020, 04:44", "content": "<blockquote><div><cite>Snapper wrote:</cite><blockquote><div><cite>I am Webb. wrote:</cite><blockquote><div><cite>lynbod wrote:</cite>This is absolutely shit, and a prime example of someone thinking they are far funnier and more interesting than they actually are.</div></blockquote><br/><br/>sort of this. - Comedy is all about timing. you've just smashed through half your story in under a page, leave your audience wanting more.<br/><br/>I'm in like but ya, know, tease us a little bit.</div></blockquote><br/><br/>Understood. <br/><br/>I won't provide any more updates for 2 to 3 months.</div></blockquote> <img alt=\":wave:\" class=\"smilies\" src=\"./images/smilies/wave_smiley.gif\" title=\"Wave\"/>"}, {"username": "Dust Puppy", "date": "31 Mar 2020, 04:52", "content": "hope the next installment won't BEE long in coming"}, {"username": "I am Webb.", "date": "31 Mar 2020, 04:58", "content": "<blockquote><div><cite>Bingoa wrote:</cite><blockquote><div><cite>CarTree wrote:</cite>Yeah, it would have been brilliant if he'd just told us that him and his girlfriend wanted to move from Dublin.  We'd have been on tender hooks, I'm sure  <img alt=\":uhoh:\" class=\"smilies\" src=\"./images/smilies/icon_uhoh.gif\" title=\"Uh oh\"/></div></blockquote><br/>Exactly. <br/><br/>There’s nothing on here that some nobhead won’t moan about.  <img alt=\":picard:\" class=\"smilies\" src=\"./images/smilies/picard.gif\" title=\"Picard\"/></div></blockquote><br/><br/>we are now at the moaning about the moaning phase.<br/><br/>It's all good though, it's padding the thread out nicely. <img alt=\":o\" class=\"smilies\" src=\"./images/smilies/icon_surprised.gif\" title=\"Surprised\"/>"}, {"username": "Snapper", "date": "31 Mar 2020, 05:00", "content": "She's my wife CarTree. My girlfriend is still in Dublin.<br/><br/>Anyway, I managed to find a few photos last night which will hopefully keep Geoff happy (the utimate goal for all of us on here tbf).<br/><br/><img alt=\"Image\" class=\"postimage\" src=\"https://i.imgur.com/ZQVk4Gi.jpg\"/><br/><br/>This is the view of the house from the garden. The three-storey grey stone building is the original mill. The entire top floor is taken up by the master bedroom (the two windows to the right are in the bedroom, the window on the left is the en-suite).<br/><br/>There is an adjoining two-storey cottage which was built at a right angle to the mill (you can see the roof and gable end of the cottage to the left. When the previous owners renovated, they knocked through to connect the mill and cottage internally by way of a single storey extension with a flat roof (beside where my car is parked).<br/><br/><img alt=\"Image\" class=\"postimage\" src=\"https://i.imgur.com/KWXprwi.jpg\"/><br/><br/>This is the other side of the house, which is the front door into the place. <br/><br/>It's a confusing layout but you get used to it  <img alt=\":lol:\" class=\"smilies\" src=\"./images/smilies/icon_lol.gif\" title=\"lol\"/> <br/><br/><img alt=\"Image\" class=\"postimage\" src=\"https://i.imgur.com/rnthWH9.jpg\"/><br/><br/><img alt=\"Image\" class=\"postimage\" src=\"https://i.imgur.com/9FKkkhs.jpg\"/><br/><br/>Some photos of the stream.<br/><br/><img alt=\"Image\" class=\"postimage\" src=\"https://i.imgur.com/wMOaYA8.jpg\"/><br/><br/>Finally, this is a photo I just found which was taken the night we got the keys for the house. It shows the radiator surround in the master bedroom with the socket in question circled. If I'd known I had this photo, I wouldn't have spent so much time drawing in MS Paint  <img alt=\":roll:\" class=\"smilies\" src=\"./images/smilies/icon_rolleyes.gif\" title=\"Roll eyes\"/> <br/><br/>Anyway, Part 4 is coming shortly."}, {"username": "humungojerry", "date": "31 Mar 2020, 05:02", "content": "<blockquote><div><cite>I am Webb. wrote:</cite><blockquote><div><cite>Bingoa wrote:</cite><blockquote><div><cite>CarTree wrote:</cite>Yeah, it would have been brilliant if he'd just told us that him and his girlfriend wanted to move from Dublin.  We'd have been on tender hooks, I'm sure  <img alt=\":uhoh:\" class=\"smilies\" src=\"./images/smilies/icon_uhoh.gif\" title=\"Uh oh\"/></div></blockquote><br/>Exactly. <br/><br/>There’s nothing on here that some nobhead won’t moan about.  <img alt=\":picard:\" class=\"smilies\" src=\"./images/smilies/picard.gif\" title=\"Picard\"/></div></blockquote><br/><br/>we are now at the moaning about the moaning phase.<br/><br/>It's all good though, it's padding the thread out nicely. <img alt=\":o\" class=\"smilies\" src=\"./images/smilies/icon_surprised.gif\" title=\"Surprised\"/></div></blockquote><br/><br/>can’t we let the thread play out without meta-commenting on the forum tropes  <img alt=\":uhoh:\" class=\"smilies\" src=\"./images/smilies/icon_uhoh.gif\" title=\"Uh oh\"/> <br/><br/><div style=\"padding: 1px; font-size: 1em;\"><div style=\"text-transform: uppercase; border-bottom: 1px solid #CCCCCC; margin-bottom: 0px; font-size: 0.8em; font-weight: bold; display: block;\"><span onclick=\"if (this.parentNode.parentNode.getElementsByTagName('div')[1].getElementsByTagName('div')[0].style.display != '') {  this.parentNode.parentNode.getElementsByTagName('div')[1].getElementsByTagName('div')[0].style.display = ''; this.innerHTML = '&lt;b&gt;Spoiler: &lt;/b&gt;&lt;a href=\\'#\\' onclick=\\'return false;\\'&gt;hide&lt;/a&gt;'; } else { this.parentNode.parentNode.getElementsByTagName('div')[1].getElementsByTagName('div')[0].style.display = 'none'; this.innerHTML = '&lt;b&gt;Spoiler: &lt;/b&gt;&lt;a href=\\'#\\' onclick=\\'return false;\\'&gt;show&lt;/a&gt;'; }\"></span><b>Spoiler: </b><a href=\"#\" onclick=\"return false;\">show</a></div></div>"}, {"username": "bluenewt", "date": "31 Mar 2020, 05:02", "content": "Very nice.<br/><br/>In!"}, {"username": "I am Webb.", "date": "31 Mar 2020, 05:05", "content": "photos  <img alt=\":adore:\" class=\"smilies\" src=\"./images/smilies/adore.gif\" title=\"Adore\"/> <br/><br/>Geoff  <img alt=\":adore:\" class=\"smilies\" src=\"./images/smilies/adore.gif\" title=\"Adore\"/> <br/><br/>A stream  <img alt=\":o\" class=\"smilies\" src=\"./images/smilies/icon_surprised.gif\" title=\"Surprised\"/>"}, {"username": "Snapper", "date": "31 Mar 2020, 05:10", "content": "<strong>Part 4 – Enter the beekeeper</strong><br/><br/>Like a good little boy who cares about the bees, I contacted the Beekeepers Association and they gave me the name and number of a local beekeeper. I phoned and spoke with a man who sounded somewhat interested in my plight, and he told me he’d call me back to arrange when he could come take a look later in the week.<br/><br/>The next evening, I got changed into a football shirt, shorts and astros to head to my regular 7-a-side game. Just as I stepped outside the front door, a car pulled into our driveway. It transpired this was the beekeeper. So much for phoning in advance to arrange.<br/><br/>It was a cold, wet night and already dark when he arrived. I was feeling like a total full kit wanker as we walked into the mill. The house was still empty at this point, so the heating was off. I was fucking frozen in my shorts to be honest and was hoping his visit would be quick so I could still make it to football. We headed up to the master bedroom so he could take a look around. <br/><br/>I showed him the bees on the windowsill. All the little lads were dead by this stage. He picked up one of them held it up to his face. “Yeah, this looks like one of mine”, he said - more to himself than to me. I asked how he could tell, but he didn’t answer. Instead he dropped to his hands and knees and put his ear to the wall, near to the socket where the electrician had been working. He stayed there for an uncomfortably long time. At one point I started to say something, just to break the awkward silence. “Shhhhh”, he hissed at me without looking, so I shut up.<br/><br/>Eventually, he clambered to his feet and said that if there was a bee-hive somewhere in our wall, then it couldn’t be a very big one. Cheers pal, I thought, that’s put me in my place. I didn’t say that though, instead I asked him why he thought that. He looked at me like I was an idiot and said “because I didn’t hear any buzzing”. Scientific stuff - so far, so very reassuring. <br/><br/>He did get a bit more in-depth with his bee expertise to be fair to him. He explained that if there was a working colony in our wall, it had probably been established by some stray bees from a nearby hive – most likely one of his hives, as he was the beekeeper living closest to me. But he thought this was unlikely, as he wasn’t missing a queen, which every working colony needs. This meant that it was more likely that the bees in our wall were some of his lads out scavenging resources from an old hive that had died. <br/><br/>Then he said that even if we did have a working hive, there is a certain kind of mite present in pretty much all beehives, which if left untreated kills bees (this is basically why bee numbers are declining). Beekeepers spray their hives regularly to kill this mite, but hives in the wild are basically doomed. A very large hive may have the numbers to withstand the mites, but he didn’t believe the hive in our wall was nearly large enough to survive. He told me that this mite-related genocide usually occurs in March as the colony begins wakes up from the cold winter. By mid-April, he reckoned, the entire hive would be dead. It was a grim outlook to be honest, but one that suited my selfish agenda.<br/><br/>I told him that we were planning to move into the master bedroom in a week or so, and asked if there was any reason that we shouldn’t do this. He said that he thought it would be perfectly fine, but if we had any issues we could give him a call and he’d come out again to re-evaluate.<br/><br/>In any case, he promised to come back during daylight and take a look at some of the external walls from outside, to see if he could determine where exactly the bees were getting in and out of the hive, as this would need to be blocked up to prevent another hive setting up at a later stage.<br/><br/>Content with this, I headed off to football. I arrived 10 minutes late. We lost. And I never spoke with that beekeeper again."}, {"username": "bluenewt", "date": "31 Mar 2020, 05:12", "content": "Sounds like a bit of a lad."}, {"username": "Valencia", "date": "31 Mar 2020, 05:17", "content": "<blockquote class=\"uncited\"><div>there is a certain kind of mite present in pretty much all beehives, which if left untreated kills bees (this is basically why bee numbers are declining). Beekeepers spray their hives regularly to kill this mite, but hives in the wild are basically doomed. </div></blockquote><br/><br/> <img alt=\":(\" class=\"smilies\" src=\"./images/smilies/icon_sad.gif\" title=\"Sad\"/> <br/><br/>Didn't know this.<br/><br/><img alt=\"Image\" class=\"postimage\" src=\"https://geneticliteracyproject.org/wp-content/uploads/2017/11/Screen-Shot-2017-08-09-at-9.38.45-AM-1024x623.png\"/><br/><br/><img alt=\"Image\" class=\"postimage\" src=\"https://www.research.bayer.com/img/30/bienen/en/varroa-mite-parasite-in-the-beehive.jpg\"/><br/><br/> <img alt=\":wave:\" class=\"smilies\" src=\"./images/smilies/wave_smiley.gif\" title=\"Wave\"/>"}, {"username": "Savage Gambler", "date": "31 Mar 2020, 05:20", "content": "Disappointed that the beekeeper is a one-off character tbf. Feel like he's got a lot to add to the saga."}, {"username": "Ellis Carver", "date": "31 Mar 2020, 05:25", "content": "Heading out for football and your mates decided to prank you by sending out the b team keeper, not a bee keeper  <img alt=\":o\" class=\"smilies\" src=\"./images/smilies/icon_surprised.gif\" title=\"Surprised\"/> <img alt=\":o\" class=\"smilies\" src=\"./images/smilies/icon_surprised.gif\" title=\"Surprised\"/>"}, {"username": "I am Webb.", "date": "31 Mar 2020, 05:28", "content": "<blockquote class=\"uncited\"><div>“Yeah, this looks like one of mine”</div></blockquote><br/><br/>Yellow and Black and stripey yeah?"}, {"username": "Endless Nameless", "date": "31 Mar 2020, 05:35", "content": "<blockquote><div><cite>I am Webb. wrote:</cite><blockquote class=\"uncited\"><div>“Yeah, this looks like one of mine”</div></blockquote><br/><br/>Yellow and Black and stripey yeah?</div></blockquote><br/>His ones have got a bit of a devil-may-care attitude. Cocky expression. Bit of a swagger about them. Can't mistake them."}, {"username": "Alligator", "date": "31 Mar 2020, 05:44", "content": "Did not know about the mites. Fuck you Varroa mites.  <img alt=\":frown:\" class=\"smilies\" src=\"./images/smilies/icon_frown.gif\" title=\"Frown\"/> <img alt=\":(\" class=\"smilies\" src=\"./images/smilies/icon_sad.gif\" title=\"Sad\"/>"}, {"username": "Domestos Salad", "date": "31 Mar 2020, 05:47", "content": "BM"}, {"username": "I am Webb.", "date": "31 Mar 2020, 05:50", "content": "<blockquote><div><cite>Endless Nameless wrote:</cite><blockquote><div><cite>I am Webb. wrote:</cite><blockquote class=\"uncited\"><div>“Yeah, this looks like one of mine”</div></blockquote><br/><br/>Yellow and Black and stripey yeah?</div></blockquote><br/>His ones have got a bit of a devil-may-care attitude. Cocky expression. Bit of a swagger about them. Can't mistake them.</div></blockquote><br/><br/>it's the twinkle in their eyes which give them away. - or would if they weren't all dead. <br/><br/>Was the Beekeeper visibly saddened by the dead bees or do you think he subscribed to the \"fuck em\" trope?"}, {"username": "jimmygrimble", "date": "31 Mar 2020, 05:54", "content": "Bzzzz"}, {"username": "Geoff", "date": "31 Mar 2020, 05:59", "content": "<blockquote><div><cite>I am Webb. wrote:</cite><blockquote><div><cite>lynbod wrote:</cite>This is absolutely shit, and a prime example of someone thinking they are far funnier and more interesting than they actually are.</div></blockquote><br/><br/>sort of this. - Comedy is all about timing. you've just smashed through half your story in under a page, leave your audience wanting more.<br/><br/>I'm in like but ya, know, tease us a little bit.</div></blockquote><br/><br/>Let the man tell his story you pair of dickheads"}, {"username": "lynbod", "date": "31 Mar 2020, 06:01", "content": "<blockquote><div><cite>Snapper wrote:</cite><blockquote><div><cite>I am Webb. wrote:</cite><blockquote><div><cite>lynbod wrote:</cite>This is absolutely shit, and a prime example of someone thinking they are far funnier and more interesting than they actually are.</div></blockquote><br/><br/>sort of this. - Comedy is all about timing. you've just smashed through half your story in under a page, leave your audience wanting more.<br/><br/>I'm in like but ya, know, tease us a little bit.</div></blockquote><br/><br/>Understood. <br/><br/>I won't provide any more updates for 2 to 3 months.</div></blockquote><br/><br/>Now this would actually.be funny.<br/><br/>Do this.<br/><br/>Don't listen to Geoff."}, {"username": "I am Webb.", "date": "31 Mar 2020, 06:02", "content": "<blockquote><div><cite>Geoff wrote:</cite><blockquote><div><cite>I am Webb. wrote:</cite><blockquote><div><cite>lynbod wrote:</cite>This is absolutely shit, and a prime example of someone thinking they are far funnier and more interesting than they actually are.</div></blockquote><br/><br/>sort of this. - Comedy is all about timing. you've just smashed through half your story in under a page, leave your audience wanting more.<br/><br/>I'm in like but ya, know, tease us a little bit.</div></blockquote><br/><br/>Let the man tell his story you pair of dickheads</div></blockquote><br/><br/>you're well behind the curve here Geoff  <img alt=\":wave:\" class=\"smilies\" src=\"./images/smilies/wave_smiley.gif\" title=\"Wave\"/>"}, {"username": "Snapper", "date": "31 Mar 2020, 06:11", "content": "<blockquote><div><cite>I am Webb. wrote:</cite>Was the Beekeeper visibly saddened by the dead bees or do you think he subscribed to the \"fuck em\" trope?</div></blockquote><br/><br/>He seemed resigned to it. I reckon if you're a beekeeper it doesn't help to get too attached to any one bee."}, {"username": "I am Webb.", "date": "31 Mar 2020, 06:19", "content": "<blockquote><div><cite>Snapper wrote:</cite><blockquote><div><cite>I am Webb. wrote:</cite>Was the Beekeeper visibly saddened by the dead bees or do you think he subscribed to the \"fuck em\" trope?</div></blockquote><br/><br/>He seemed resigned to it. I reckon if you're a beekeeper it doesn't help to get too attached to any one bee.</div></blockquote><br/><br/>must be tough being a beekeeper. sat at home every night, thousand yard stare. \"the things I've seen\"  <img alt=\":scared:\" class=\"smilies\" src=\"./images/smilies/scared.png\" title=\"Scared\"/>"}, {"username": "Completely Pogued", "date": "31 Mar 2020, 06:20", "content": "I thought we were killing the bees? It turns out to be bastard mites all along <img alt=\":wave:\" class=\"smilies\" src=\"./images/smilies/wave_smiley.gif\" title=\"Wave\"/> <img alt=\":wave:\" class=\"smilies\" src=\"./images/smilies/wave_smiley.gif\" title=\"Wave\"/> <img alt=\":wave:\" class=\"smilies\" src=\"./images/smilies/wave_smiley.gif\" title=\"Wave\"/> <br/><br/>B.M."}, {"username": "Geoff", "date": "31 Mar 2020, 06:25", "content": "House looks absolutely lovely btw, exactly what I was hoping for. Looks huge as well."}, {"username": "I am Webb.", "date": "31 Mar 2020, 06:30", "content": "<object height=\"350\" width=\"425\">\n<param name=\"movie\" value=\"http://www.youtube.com/v/p2Ne-TYHZXA&amp;hl=en_US&amp;fs=1&amp;\"/>\n<param name=\"allowFullScreen\" value=\"true\"/><param name=\"allowscriptaccess\" value=\"always\"/>\n<embed allowfullscreen=\"true\" allowscriptaccess=\"always\" height=\"350\" src=\"http://www.youtube.com/v/p2Ne-TYHZXA&amp;hl=en_US&amp;fs=1&amp;\" type=\"application/x-shockwave-flash\" width=\"425\"/>\n</object>"}, {"username": "justme2009", "date": "31 Mar 2020, 06:44", "content": "Enjoyable story and I'm looking forward to the updates<br/><br/>In light of current events the beekeepers comments regarding the mite and herd immunity was interesting<br/><br/>Cork is beautiful, especially West Cork, it's a pity about Cork people and their delusional perception of themselves"}, {"username": "Binoculars", "date": "31 Mar 2020, 06:54", "content": "buzzmark"}, {"username": "Triangler", "date": "31 Mar 2020, 07:05", "content": "Where's the fucking Oprah gif?  <img alt=\":mad:\" class=\"smilies\" src=\"./images/smilies/icon_mad.gif\" title=\"Mad\"/> <br/>I'll have a read of this later."}, {"username": "u360213", "date": "31 Mar 2020, 07:07", "content": "Enjoying it. A gentle story in troubling times  <img alt=\":thumbup:\" class=\"smilies\" src=\"./images/smilies/icon_thumbsup.gif\" title=\"Thumb Up\"/>"}, {"username": "Endless Nameless", "date": "31 Mar 2020, 07:10", "content": "I was enjoying it until the photos, then I just felt sad that I will never live in a house as nice as that one."}, {"username": "Smith 9", "date": "31 Mar 2020, 07:26", "content": "Mite-genocide <img alt=\":scared:\" class=\"smilies\" src=\"./images/smilies/scared.png\" title=\"Scared\"/> <br/><br/>No problem for my resident bumblers <img alt=\":smug:\" class=\"smilies\" src=\"./images/smilies/icon_smug.gif\" title=\"Smug\"/>"}, {"username": "Snapper", "date": "31 Mar 2020, 07:33", "content": "<blockquote><div><cite>Endless Nameless wrote:</cite>I was enjoying it until the photos, then I just felt sad that I will never live in a house as nice as that one.</div></blockquote><br/><br/>Never say never, 10 years ago I couldn't have imagined that I would live in a place like this but that's how it worked out. I am very fortunate to live here, it's lovely. <br/><br/>Although, it's not perfect - did you hear that I had a small problem with some bees?"}, {"username": "Snapper", "date": "31 Mar 2020, 07:55", "content": "<strong>Part 5 – Busy little bee</strong><br/><br/>The next weekend was a bank holiday in Ireland due to St Patrick’s Day. My wife was in the US for work, so I found myself spending the long weekend alone, moving our possessions from the cottage to the mill. I also decided to paint the newly fitted en-suite bathroom. Great craic altogether, St Patrick would have been proud. Anyway, I got everything moved over and gave the keys for the cottage to our friend so he could move in there. I stuck the heating on full blast in the mill to get some heat into the place – it hadn’t been on very much when nobody was living there – and got cracking with putting stuff away and painting.<br/><br/>Before too long, the buzzing began. I was in the bathroom painting and I had Alexa for company. Between lulls in our witty back and forth (“Alexa, how do I get rid of this erection?”… “I’m sorry, I don’t know that one”), I gradually realised that a constant background noise had developed. Bzzzz. <br/><br/>I went to investigate. It was coming from the section of the surround above the notorious socket. It wasn’t particularly loud – it sounded like just a few bees buzzing around in the wall. I pushed on with painting, ignoring the noise in the way that only a man can when he is hoping a problem will resolve itself without him having to do any work.<br/><br/>I finished painting the en-suite and then put the master bedroom to rights, carefully putting my clothes away in my side of the new built-in wardrobe, and throwing my wife’s clothes into an untidy pile in her side. The room was looking pretty good so I went downstairs and did some similar unpacking in the kitchen and the living room. That night, I slept the sleep of a man who was tired from painting and unpacking. I didn’t hear any more buzzing.<br/><br/>A few days later, my wife got back from her work trip and I decided to visit my office in Dublin. I had agreed with my boss that I would show face for a couple of days every month just to remind people that I existed, so I booked myself into a hotel and headed up the motorway. That night, I phoned my wife from the hotel and she told me that she was going to sleep in the spare room because she could hear buzzing in the master bedroom, and that a few more dead bees had appeared on the floor. <br/><br/>When I got back the following night, I found that a slow but steady stream of bees had begun to find their way out from inside the walls. They were still lethargic but were more alert than before. Some of them could even fly for a few feet before dropping to the floor with a light thud. It was clear that the hive had begun to awaken – due either to the warmer spring weather or to the warmer house, given that the radiators were now on more frequently than before. <br/><br/>Over the next few days, the buzzing behind the wall became louder and louder, and was now nearly constant during daylight hours. More and more bees started finding their way out from behind the radiator. And for every bee that made it out of the wall, it sounded like there were hundreds still in there.<br/><br/>I went outside to see if this increased bee activity had an obvious entry point. I located a section of pointing in the mortar that had some visible cracks in it. I watched for a while and could see bees coming and going. I had found their access point into the house. <br/><br/><img alt=\"Image\" class=\"postimage\" src=\"https://i.imgur.com/xHEannV.jpg\"/><br/><br/>Circled in blue are the bedroom windows, in green is where the bee traffic was most concentrated. It made sense that they were showing up inside where they were, I reckoned the socket would be smack bang in the middle of the green circle.<br/><br/>So the mortar would need to be re-pointed to close up any gaps, but it was work that would need to be done at height. It was far too risky an undertaking with the bees coming and going. We would need to wait for the hive to die first, then take care of the re-pointing. <br/><br/>In the meantime, I had to take some action. I found some old bed sheets and cut them up, then used packing tape to tightly secure the sheets to the radiator surround, thus (I hoped) imprisoning the bees in the wall and at least preventing them from coming into the bedroom. My plan was no more than one of containment. I hoped to temporarily create a liveable situation where we could we wait for the mites to take care of their nasty business."}, {"username": "Geoff", "date": "31 Mar 2020, 08:03", "content": "bees"}, {"username": "elrobertos", "date": "31 Mar 2020, 08:04", "content": "Really enjoying this. You write well."}, {"username": "Lolhurst", "date": "31 Mar 2020, 08:05", "content": "Building up nicely  <img alt=\":lol:\" class=\"smilies\" src=\"./images/smilies/icon_lol.gif\" title=\"lol\"/> <br/>Snapper  <img alt=\":toppa:\" class=\"smilies\" src=\"./images/smilies/5.gif\" title=\"Toppa\"/>"}, {"username": "Smith 9", "date": "31 Mar 2020, 08:08", "content": "So much for the wise words of the beekeeper <img alt=\":roll:\" class=\"smilies\" src=\"./images/smilies/icon_rolleyes.gif\" title=\"Roll eyes\"/>"}, {"username": "Mini", "date": "31 Mar 2020, 08:27", "content": "B(ee)M"}, {"username": "I like traffic lights", "date": "31 Mar 2020, 08:27", "content": "Great story telling. I wonder how many bees will be in there?"}, {"username": "b_31", "date": "31 Mar 2020, 08:46", "content": "get to the bit were you have to rip out all of the walls and expose a hive the size of a house  <img alt=\":wave:\" class=\"smilies\" src=\"./images/smilies/wave_smiley.gif\" title=\"Wave\"/>"}, {"username": "I am Webb.", "date": "31 Mar 2020, 08:58", "content": "<blockquote><div><cite>b_31 wrote:</cite>get to the bit were you have to rip out all of the walls and expose a hive the size of a house  <img alt=\":wave:\" class=\"smilies\" src=\"./images/smilies/wave_smiley.gif\" title=\"Wave\"/></div></blockquote><br/><br/>the twist is that the entire house is just painted on the side of a huge hive."}, {"username": "Theposh11", "date": "31 Mar 2020, 09:21", "content": "I'm enjoying this, nicely paced."}, {"username": "Ninjacuts", "date": "31 Mar 2020, 09:26", "content": "The bee keeper sounds like he had a big beard. Did he?"}, {"username": "Tommytonks", "date": "31 Mar 2020, 09:31", "content": "<blockquote><div><cite>Ninjacuts wrote:</cite>The bee keeper sounds like he had a big beard. Did he?</div></blockquote><br/><br/>A beerd even"}, {"username": "humungojerry", "date": "31 Mar 2020, 09:37", "content": "<blockquote><div><cite>Valencia wrote:</cite><blockquote class=\"uncited\"><div>there is a certain kind of mite present in pretty much all beehives, which if left untreated kills bees (this is basically why bee numbers are declining). Beekeepers spray their hives regularly to kill this mite, but hives in the wild are basically doomed. </div></blockquote><br/><br/> <img alt=\":(\" class=\"smilies\" src=\"./images/smilies/icon_sad.gif\" title=\"Sad\"/> <br/><br/>Didn't know this.<br/><br/><img alt=\"Image\" class=\"postimage\" src=\"https://geneticliteracyproject.org/wp-content/uploads/2017/11/Screen-Shot-2017-08-09-at-9.38.45-AM-1024x623.png\"/><br/><br/><img alt=\"Image\" class=\"postimage\" src=\"https://www.research.bayer.com/img/30/bienen/en/varroa-mite-parasite-in-the-beehive.jpg\"/><br/><br/> <img alt=\":wave:\" class=\"smilies\" src=\"./images/smilies/wave_smiley.gif\" title=\"Wave\"/></div></blockquote><br/><br/>Varroa-19  <img alt=\":wave:\" class=\"smilies\" src=\"./images/smilies/wave_smiley.gif\" title=\"Wave\"/>"}, {"username": "humungojerry", "date": "31 Mar 2020, 09:39", "content": "<blockquote><div><cite>Completely Pogued wrote:</cite>I thought we were killing the bees? It turns out to be bastard mites all along <img alt=\":wave:\" class=\"smilies\" src=\"./images/smilies/wave_smiley.gif\" title=\"Wave\"/> <img alt=\":wave:\" class=\"smilies\" src=\"./images/smilies/wave_smiley.gif\" title=\"Wave\"/> <img alt=\":wave:\" class=\"smilies\" src=\"./images/smilies/wave_smiley.gif\" title=\"Wave\"/> <br/><br/>B.M.</div></blockquote><br/><br/>tbf it is our fault<br/><br/>particularly in the US, they have problems with disease because the beekeepers are like travelling salesmen, they take their bees all over the place to pollinate things, mainly almond trees. the moving around increases the spread of disease. of course there are other things like pesticides."}, {"username": "milomak", "date": "31 Mar 2020, 09:44", "content": "enjoying this"}, {"username": "Dan!", "date": "31 Mar 2020, 09:48", "content": "<blockquote><div><cite>I like traffic lights wrote:</cite>Great story telling. I wonder how many bees will be in there?</div></blockquote><br/>Beellions"}, {"username": "Portersforce", "date": "31 Mar 2020, 09:52", "content": "This is great  <img alt=\":o\" class=\"smilies\" src=\"./images/smilies/icon_surprised.gif\" title=\"Surprised\"/>"}, {"username": "Mujo", "date": "31 Mar 2020, 09:58", "content": "I hope this ends with every man and bee joining together in honey sweet harmony  <img alt=\":o\" class=\"smilies\" src=\"./images/smilies/icon_surprised.gif\" title=\"Surprised\"/>"}, {"username": "Endless Nameless", "date": "31 Mar 2020, 10:16", "content": "<blockquote><div><cite>I am Webb. wrote:</cite><blockquote><div><cite>b_31 wrote:</cite>get to the bit were you have to rip out all of the walls and expose a hive the size of a house  <img alt=\":wave:\" class=\"smilies\" src=\"./images/smilies/wave_smiley.gif\" title=\"Wave\"/></div></blockquote><br/><br/>the twist is that the entire house is just painted on the side of a huge hive.</div></blockquote><br/>Like when the camera pans out in the final shot of From Dusk Till Dawn  <img alt=\":nod:\" class=\"smilies\" src=\"./images/smilies/icon_nod.gif\" title=\"Nod\"/>"}, {"username": "CarTree", "date": "31 Mar 2020, 10:18", "content": "<blockquote><div><cite>I am Webb. wrote:</cite><blockquote><div><cite>b_31 wrote:</cite>get to the bit were you have to rip out all of the walls and expose a hive the size of a house  <img alt=\":wave:\" class=\"smilies\" src=\"./images/smilies/wave_smiley.gif\" title=\"Wave\"/></div></blockquote><br/><br/>the twist is that the entire house is just painted on the side of a huge hive.</div></blockquote><br/> <img alt=\":lol:\" class=\"smilies\" src=\"./images/smilies/icon_lol.gif\" title=\"lol\"/>"}, {"username": "Snapper", "date": "31 Mar 2020, 10:24", "content": "<blockquote><div><cite>Ninjacuts wrote:</cite>The bee keeper sounds like he had a big beard. Did he?</div></blockquote><br/><br/>He did not. He was clean-shaven. <br/><br/>Part 6 incoming!"}, {"username": "Ninjacuts", "date": "31 Mar 2020, 10:28", "content": "<img alt=\":sulk:\" class=\"smilies\" src=\"./images/smilies/1.gif\" title=\"Sulk\"/>"}, {"username": "Snapper", "date": "31 Mar 2020, 10:33", "content": "<strong>Part 6 –  Or the part where I start to wonder if the beekeeper mite bee wrong?</strong><br/><br/>With the radiator now sealed off, I had stemmed the growing tide of bees making their way onto the bedroom floor. My wife decided that she was OK with sleeping in the master bedroom, at least as long as I was in the house (makes a change lol). Her side of the bed was furthest from the hive so I suppose she figured I’d get Wicker-manned first, should there be a breach. It also helped that at night the buzzing would go quiet as all the little bees tucked themselves into bed, so it didn’t really disturb us too much at first.<br/><br/>The situation went on like that for a couple of weeks but instead of getting better, it gradually got worse. As March became April, daylight became longer and the weather became warmer. The bees behind the wall would start their buzzing as soon as dawn broke and would continue that way until darkness fell, when it would finally fade into silence. The noise level of their activities increased as I guess more and more bees were coming out of slumber. <br/><br/>One day, the bees that had managed to find their way out of the wall and into the gaps around the left-side radiator began to find their way through to the gap around the radiator on the right. I still don’t know how they did this – there didn’t seem to be any way through that wasn’t sealed off with expanding foam. I suppose with enough bees buzzing around in such a tight space, it was inevitable that they would find a way. I was forced to implement another bed-sheet solution on the second radiator. <br/><br/>This is a photo of the finished job… Pretty neat, I’m sure you will agree.  <img alt=\":smug:\" class=\"smilies\" src=\"./images/smilies/icon_smug.gif\" title=\"Smug\"/> <br/><br/><img alt=\"Image\" class=\"postimage\" src=\"https://i.imgur.com/kib2GIR.jpg\"/><br/><br/>At this point though, the day-to-day situation was becoming unbearable. Although the bees quietened after dark, if we turned on the lights in the bedroom it would wake them up, and you’d hear the buzzing slowly begin. If we left the lights on for more than a minute or so, we’d begin to see little indentations appear in the bedsheets, as bees began to thrust themselves against the fabric, looking for the source of the light. Each thrust was accompanied by a faint but incredibly disconcerting pop. These fuckers were clearly hoping to find a weakspot in my fortifications. <br/><br/>Alarmingly, the bedsheets began to become stained with little brown dots. This puzzled me at first, until I realised that tiny particles of beeswax were being transferred from their bodies to the bedsheets with every failed attempt to break through the fabric.<br/><br/>Also – and I know it's hypocritical to complain about this, given that I was the cause of their death – the dead bees had begun to pile up inside the sheets and quite frankly they had started to smell. It wasn’t an awful smell but it was far from pleasant, and it was getting stronger. The number of wax-marks on the bedsheets began to increase and this started to stink too. <br/><br/>All in all, the bedroom was becoming a rather unpleasant place to be (for me at least, my wife would probably argue it’s always been an unpleasant place for her). When I couldn’t suffer the smell any longer, or stand to look at the stained sheets, I decided to remove them, clean out the bee graveyard as best I could and put up some fresh ones. Think about that the next time you’re complaining about having to change your bedsheets and thank your lucky stars. This is a photo of what the scene was like behind the sheet during one such operation. <br/><br/><img alt=\"Image\" class=\"postimage\" src=\"https://i.imgur.com/0p7uARA.jpg\"/><br/><br/>This was the right-side radiator. There were far more dead bodies in the left-side one, to the extent that there was a significant bulge developing at the bottom of the sheet where the bodies had gathered. But there were also a lot more live bees in the left-side one, so I wasn’t stopping to take a photo when I changed those sheets. I had to repeat the sheet-changing every week or so to keep the situation somewhat tolerable.<br/><br/>By the middle of April 2019, with an increasingly stressful sleep situation and an increasingly unhappy wife, I decided that enough was enough. I had lost faith in the mites – they clearly weren’t up to the task of killing the hive. Seriously guys, you had one job ffs.<br/><br/>I phoned the beekeeper to see if he would come back out and re-evaluate the situation as he said he would. No answer. I left a few voicemails, sent a few texts. No answer. I slid some DMs into his Twitter (@thatstupidbeekeeper). No answer. <br/><br/>At this point I got back onto the Beekeeper’s Association. They told me they would reach out to him. I waited a few days. I heard nothing. I called them back. They’d heard nothing. I asked them for the name and number of another beekeeper who could help. They refused to give me these details as in their eyes, the first guy now had dibs on my bees. What?? Is that a thing?? I tried to reason with them, hoping they would relent but they were steadfast. Unless I heard back from beekeeper, which seemed unlikely, I was on my own.<br/><br/>The situation was becoming ever more dire, and I’d been abandoned by the one organisation I thought I could trust when it came to bees. Without the might of Beekeeper’s Association behind me, I was a desperate man, all out of options and running out of time. So I decided to do the one thing they say you should never do in a bee-related scenario: I went rogue."}, {"username": "Mujo", "date": "31 Mar 2020, 10:39", "content": "Oh. My. God."}, {"username": "dizzy_rascal", "date": "31 Mar 2020, 10:45", "content": "Some nice horror elements in part 6 there, well played  <img alt=\":toppa:\" class=\"smilies\" src=\"./images/smilies/5.gif\" title=\"Toppa\"/>"}, {"username": "CarTree", "date": "31 Mar 2020, 10:47", "content": "lynbod should be known as lynod from now on.  He doesn't deserve his b."}, {"username": "SuperTomasRepka", "date": "31 Mar 2020, 10:49", "content": "I don't beelieve it"}, {"username": "Tommytonks", "date": "31 Mar 2020, 10:54", "content": "<blockquote><div><cite>CarTree wrote:</cite>lynbod should be known as lynod from now on.  He doesn't deserve his b.</div></blockquote><br/><br/>He deserves thousands of bs"}, {"username": "Happy Jack", "date": "31 Mar 2020, 11:04", "content": "This is helping pass the time nicely"}, {"username": "Jebus", "date": "31 Mar 2020, 11:15", "content": "This thread has everything.<br/>All we need now is KI to show up and tell us about how he drove the bees from Manchester"}, {"username": "I am Webb.", "date": "31 Mar 2020, 11:16", "content": "I do hope there's a Henry hoover in part 7. <br/><br/>That beekeeper though, what a prick  <img alt=\":wave:\" class=\"smilies\" src=\"./images/smilies/wave_smiley.gif\" title=\"Wave\"/>"}, {"username": "Skinny Pete", "date": "31 Mar 2020, 11:18", "content": "I'm expecting a \"Yep. This is me. ...\" picture of the OP with a thousand bee stings on his face in the next update."}, {"username": "Sidey", "date": "31 Mar 2020, 11:22", "content": "BEE-M"}, {"username": "milomak", "date": "31 Mar 2020, 11:23", "content": "<blockquote><div><cite>Snapper wrote:</cite><strong>Part 6 –  Or the part where I start to wonder if the beekeeper mite bee wrong?</strong><br/> I asked them for the name and number of another beekeeper who could help. They refused to give me these details as in their eyes, the first guy now had dibs on my bees. What?? Is that a thing?? I tried to reason with them, hoping they would relent but they were steadfast. Unless I heard back from beekeeper, which seemed unlikely, I was on my own.</div></blockquote><br/>fantastic stuff right here  <img alt=\":lol:\" class=\"smilies\" src=\"./images/smilies/icon_lol.gif\" title=\"lol\"/> <img alt=\":lol:\" class=\"smilies\" src=\"./images/smilies/icon_lol.gif\" title=\"lol\"/> <img alt=\":lol:\" class=\"smilies\" src=\"./images/smilies/icon_lol.gif\" title=\"lol\"/>"}, {"username": "Ron Jeremy", "date": "31 Mar 2020, 11:28", "content": "Glorious thread, top work  <img alt=\":toppa:\" class=\"smilies\" src=\"./images/smilies/5.gif\" title=\"Toppa\"/>"}, {"username": "Geoff", "date": "31 Mar 2020, 11:29", "content": "The fucking gall of the bee-keepers association  <img alt=\":mad:\" class=\"smilies\" src=\"./images/smilies/icon_mad.gif\" title=\"Mad\"/>"}, {"username": "Ninjacuts", "date": "31 Mar 2020, 11:31", "content": "<blockquote><div><cite>Geoff wrote:</cite>The fucking gall of the bee-keepers association  <img alt=\":mad:\" class=\"smilies\" src=\"./images/smilies/icon_mad.gif\" title=\"Mad\"/></div></blockquote><br/>A hive of scum and villainy."}, {"username": "Kyroplastics", "date": "31 Mar 2020, 11:32", "content": "<blockquote><div><cite>Jebus wrote:</cite>This thread has everything.<br/>All we need now is KI to show up and tell us about how he drove the bees from Manchester</div></blockquote><br/><br/>I'm pretty sure that's why the decided to put bee icons around the city in tribute."}, {"username": "Geoff", "date": "31 Mar 2020, 11:34", "content": "St Icarus now. Patron saint of Manchester for getting rid of all the bees. Even though he comes from Lincolnshire.<br/><br/>And also bees are a good thing overall. <br/><br/>So he should be the opposite of a saint. What's that? A Demon?"}, {"username": "Mujo", "date": "31 Mar 2020, 11:38", "content": "<blockquote><div><cite>Geoff wrote:</cite>St Icarus now. Patron saint of Manchester for getting rid of all the bees. Even though he comes from Lincolnshire.<br/><br/>And also bees are a good thing overall. <br/><br/>So he should be the opposite of a saint. What's that? A Demon?</div></blockquote><br/><br/>In his case, a twat."}, {"username": "bluenewt", "date": "31 Mar 2020, 11:57", "content": "<blockquote><div><cite>Ninjacuts wrote:</cite><blockquote><div><cite>Geoff wrote:</cite>The fucking gall of the bee-keepers association  <img alt=\":mad:\" class=\"smilies\" src=\"./images/smilies/icon_mad.gif\" title=\"Mad\"/></div></blockquote><br/>A hive of scum and villainy.</div></blockquote><br/><br/>Hope you comb the land looking for him <img alt=\":wave:\" class=\"smilies\" src=\"./images/smilies/wave_smiley.gif\" title=\"Wave\"/>"}, {"username": "Skizziks Willit", "date": "31 Mar 2020, 12:02", "content": "<blockquote><div><cite>Snapper wrote:</cite><strong>Part 5 – Busy little bee</strong><br/><br/>A few days later, my wife got back from her work trip</div></blockquote><br/><br/>Did she say, \"HONEY, I'm home!\" ?<br/><br/>Sorry, I meant to say Bookmark."}, {"username": "Cachonding Hispalis", "date": "31 Mar 2020, 12:15", "content": "Gloriously done. Give us more!!"}, {"username": "Valencia", "date": "31 Mar 2020, 12:17", "content": "<blockquote><div><cite>Jebus wrote:</cite>This thread has everything.<br/>All we need now is KI to show up and tell us about how he drove the bees from Manchester</div></blockquote><br/><br/> <img alt=\":lol:\" class=\"smilies\" src=\"./images/smilies/icon_lol.gif\" title=\"lol\"/> <br/><br/>That photo of the sheets and the monkey is so  <img alt=\":uhoh:\" class=\"smilies\" src=\"./images/smilies/icon_uhoh.gif\" title=\"Uh oh\"/>"}, {"username": "Snapper", "date": "31 Mar 2020, 12:22", "content": "OK so this is going to require more parts than I thought. There will be at least 11 parts. I still hope to finish tomorrow. With this in mind, have Part 7.<br/><br/><br/><br/><strong>Part 7 – The black-market bee-boys</strong><br/><br/>I’d put my trust in the system, but the system had failed me. I didn’t know where to turn. Sure, we’ve all <em>heard </em>of the kind of beekeepers who’ll take your bees from you no questions asked, but how does a law-abiding man go about finding one? The dark web? Did I need to download the Ice Dragon browser for that? Did I risk getting my fingers burned? This was all too much for me. I started to cry. My wife suggested trying Facebook. I started to laugh. I laughed at her until she left the room in anger. Then I thought about what she’d said. I went onto Facebook.<br/><br/>I needed to cover my tracks, so the first thing I did was set up a fake Facebook profile. I used a name I had been using as an alias for a while, taken from a sushi menu I’d seen in Tokyo. Once that was done, I signed Jack Mackerel up to a few local notice boards and posted about the problem. Amongst the many hilarious but not particularly helpful replies - “I hope it doesn’t cost too much to fix, as I’ve heard of people getting STUNG”, “Lots of BUZZ about this kind of thing at the moment”, “Stupid bee wanker” (that last one was posted by me from my actual FB profile  <img alt=\":smug:\" class=\"smilies\" src=\"./images/smilies/icon_smug.gif\" title=\"Smug\"/> ) - there was one promising post from a guy named Mark. <br/><br/>Mark said that he was a rookie young beekeeper, just starting out in the game, and keen to get his beekeeping mitts on my bees before anyone else did. Show me the honey, his hungry tone seemed to say. He sent me his phone number in a private message. I rooted out a burner phone, drove to a remote spot to prevent the feds from triangulating my location, and gave him a call. <br/><br/>He explained that he had recently started beekeeping as a hobby, and that he was looking to get more bees to grow his hive. I told him he was more than welcome to my bees, as I really wasn’t using them, but that it was a collection-only situation. He seemed very eager and said he’d come over straight away to take a look. I’d had weeks of nothing happening so this sudden change of pace was welcome. I told him I’d meet him there, gave him my address and drove home.<br/><br/>When I got back to the house, I pulled into the driveway only to find two weedy, pale-skinned urchins loitering on my property. “Clear out of here you little bastards!” I roared at them, “I’ve got a beekeeper coming over!”<br/><br/> “B-buh-but… I’m M-Mark” one of them stammered, “I’m the beekeeper!”<br/><br/>I must admit was shocked. These lads genuinely looked around 12 years of age. Could I really entrust this job to a couple of children? I thought about it. Fuck it. Kids make pretty much all my clothing, so why not let them do this too? And it’s not like there were a load of adults queuing up to help.<br/><br/>Well, it turned out that Mark was actually 18 and was just about to finish school, and the other guy was his (older!) brother, who was actually 20(!!) and in his second year of university(!!!). They really did look a lot younger than they were. Or maybe thinking a beekeeper looks young is just a sign of getting old, like with policemen.<br/><br/>They went upstairs and had a quick look around the bedroom. It was still daylight and there was a lot more bee activity than when the other beekeeper had come over. It was clear from the excitement in their voices as they spoke to each other that they saw this as a potential big score. <br/><br/>I asked how many bees they had already. “Around ten thousand”. And how many did they think were in my walls? “We won’t know for sure until we’re taking them out, but maybe the same again”. I thought about this and quickly realised I didn’t know what to do with this information. Ten thousand bees. It sounded like a lot. Was it a lot? Who knows? Who cares? <br/><br/>I asked what approach they planned to take. They said they would come back the following evening with their beekeeping suits. They'd need to bring a smoker to subdue the bees. I said I’d love to help, but I’d recently given up. They chuckled politely. It was a poor gag in truth, I realise that now. I'm one of those people who thinks they are funnier and more interesting than they actually are. I'm that to a fault really... Sorry lynbod.<br/><br/>They would also bring a frame full of removable wooden trays to transfer the bees into. They would then lock this up and take it away to their beehive where they would rehome the bees. They said they would need to take some of the surround away from the wall for access, but insisted they would do their best to replace it afterwards. I said fine, no problem. <br/><br/>Now, I know there are a whole load of questions I should have asked at this point. I'm sure you're asking them yourselves. But I didn't ask any further questions. They honestly gave me no indication that the process was going to be particularly taxing or messy. That may seem foolish to you (in hindsight it definitely seems foolish to me). All I can say in my defence is that I’m a fool."}, {"username": "Mujo", "date": "31 Mar 2020, 12:26", "content": "Hammer time."}, {"username": "Smith 9", "date": "31 Mar 2020, 12:39", "content": "'Show me the honey' <img alt=\":lol:\" class=\"smilies\" src=\"./images/smilies/icon_lol.gif\" title=\"lol\"/> <br/><br/>They're gonna demolish  the wall, aren't they <img alt=\":nod:\" class=\"smilies\" src=\"./images/smilies/icon_nod.gif\" title=\"Nod\"/>"}, {"username": "Tommytonks", "date": "31 Mar 2020, 12:42", "content": "<blockquote><div><cite>Geoff wrote:</cite>The fucking gall of the bee-keepers association  <img alt=\":mad:\" class=\"smilies\" src=\"./images/smilies/icon_mad.gif\" title=\"Mad\"/></div></blockquote><br/><br/>Bee quiet, they'll hear you. Don't know which bee buzzing around is one of theirs..."}, {"username": "bluenewt", "date": "31 Mar 2020, 12:43", "content": "I had no idea bees were so valuable <img alt=\":lol:\" class=\"smilies\" src=\"./images/smilies/icon_lol.gif\" title=\"lol\"/>"}, {"username": "The Wookie", "date": "31 Mar 2020, 12:44", "content": "pure gold.  <img alt=\":toppa:\" class=\"smilies\" src=\"./images/smilies/5.gif\" title=\"Toppa\"/>"}, {"username": "OperationGoodisonExercise", "date": "31 Mar 2020, 12:44", "content": "Excellent precautions re Ice Dragon, heard a few people been stung"}, {"username": "I am Webb.", "date": "31 Mar 2020, 12:45", "content": "<img alt=\":lol:\" class=\"smilies\" src=\"./images/smilies/icon_lol.gif\" title=\"lol\"/> <img alt=\":adore:\" class=\"smilies\" src=\"./images/smilies/adore.gif\" title=\"Adore\"/>"}, {"username": "Completely Pogued", "date": "31 Mar 2020, 12:46", "content": "Photo of the OP <img alt=\"Image\" class=\"postimage\" src=\"https://images.amcnetworks.com/bbcamerica.com/wp-content/uploads/2016/11/The_Graham_Norton_Show_S20_E05_OMG_Moment_3_YouTube_Preset_1920x1080_800060995624.jpg\"/>"}, {"username": "Envelope", "date": "31 Mar 2020, 12:55", "content": "Great thread.<br/><br/>Lynbod really has been outed as a mug here."}, {"username": "Ninjacuts", "date": "31 Mar 2020, 12:57", "content": "<blockquote><div><cite>Envelope wrote:</cite>Lynbod really has been outed as a mug here.</div></blockquote><br/>Not the first, won't be the last <img alt=\":lol:\" class=\"smilies\" src=\"./images/smilies/icon_lol.gif\" title=\"lol\"/> <br/><br/><br/>I have high hopes for these young beekeeper upstarts <img alt=\":nod:\" class=\"smilies\" src=\"./images/smilies/icon_nod.gif\" title=\"Nod\"/>"}, {"username": "lynbod", "date": "31 Mar 2020, 13:03", "content": "<blockquote><div><cite>Envelope wrote:</cite>Great thread.<br/><br/>Lynbod really has been outed as a mug here.</div></blockquote><br/><br/>it was a dreadful start but i have to say like a fine mead this thread is improving with age."}, {"username": "milomak", "date": "31 Mar 2020, 13:04", "content": "i am so looking forward to the jackhammer to the wall surprise <img alt=\":lol:\" class=\"smilies\" src=\"./images/smilies/icon_lol.gif\" title=\"lol\"/>"}, {"username": "I like traffic lights", "date": "31 Mar 2020, 13:06", "content": "This thread and KI's smack head guerilla army one have really helped to get over corona lock down and bring a bit of a buzz back into our lives"}, {"username": "Valencia", "date": "31 Mar 2020, 13:06", "content": "<blockquote class=\"uncited\"><div>“Stupid bee wanker”</div></blockquote><br/><br/>If only admins could still do name changes  <img alt=\":lol:\" class=\"smilies\" src=\"./images/smilies/icon_lol.gif\" title=\"lol\"/>"}, {"username": "Smith 9", "date": "31 Mar 2020, 13:17", "content": "<blockquote><div><cite>I like traffic lights wrote:</cite>This thread and KI's smack head guerilla army one have really helped to get over corona lock down and bring a bit of a buzz back into our lives</div></blockquote><br/><br/>Mate, you may mock, but those boys deliberately break windows in abandoned building sites, and<em> no-one notices.</em>"}, {"username": "Grifter", "date": "31 Mar 2020, 13:19", "content": "I'm hooked! MOAR!<br/><br/>Although I really think young Mark has good intentions but will royally balls this up  <img alt=\":uhoh:\" class=\"smilies\" src=\"./images/smilies/icon_uhoh.gif\" title=\"Uh oh\"/> <br/><br/>Bee back later  <img alt=\":toppa:\" class=\"smilies\" src=\"./images/smilies/5.gif\" title=\"Toppa\"/>"}, {"username": "Cachonding Hispalis", "date": "31 Mar 2020, 13:28", "content": "Loving the asides, one of the best reads on the forum in a long time.  <img alt=\":adore:\" class=\"smilies\" src=\"./images/smilies/adore.gif\" title=\"Adore\"/>"}, {"username": "Snapper", "date": "31 Mar 2020, 13:40", "content": "<blockquote><div><cite>lynbod wrote:</cite><blockquote><div><cite>Envelope wrote:</cite>Great thread.<br/><br/>Lynbod really has been outed as a mug here.</div></blockquote><br/><br/>it was a dreadful start but i have to say like a fine mead this thread is improving with age.</div></blockquote><br/><br/>Tbf to you, it took me a while to find my feet telling the story. I reread the first few parts before I posted them and even I found them boring so I rewrote some parts to try inject some humour and life into the story because they were going to kill the thread before it got started.<br/><br/>So if it's a bit disjointed or tries too hard at the beginning, that may explain why. <br/><br/>Anyway, it seems a lot of people are enjoying this and it's a welcome diversion from all the other stuff going on so I'm happy with that. <br/><br/>I'll post the rest of the parts tomorrow. I reckon there's 4 more (this goes to 11). <br/><br/>Part 8 will probably make me unpopular with large sections of the forum so we'll see how that goes."}, {"username": "Skinny Pete", "date": "31 Mar 2020, 13:44", "content": "<blockquote><div><cite>bluenewt wrote:</cite>I had no idea bees were so valuable <img alt=\":lol:\" class=\"smilies\" src=\"./images/smilies/icon_lol.gif\" title=\"lol\"/></div></blockquote><br/><blockquote><div><cite>The Wookie wrote:</cite>pure gold.  <img alt=\":toppa:\" class=\"smilies\" src=\"./images/smilies/5.gif\" title=\"Toppa\"/></div></blockquote><br/>I don't think they're that valuable."}, {"username": "milomak", "date": "31 Mar 2020, 13:45", "content": "<blockquote><div><cite>Snapper wrote:</cite>Part 8 will probably make me unpopular with large sections of the forum so we'll see how that goes.</div></blockquote><br/>by god, you are also a buy to rent landlord  <img alt=\":wave:\" class=\"smilies\" src=\"./images/smilies/wave_smiley.gif\" title=\"Wave\"/> <img alt=\":wave:\" class=\"smilies\" src=\"./images/smilies/wave_smiley.gif\" title=\"Wave\"/> <img alt=\":wave:\" class=\"smilies\" src=\"./images/smilies/wave_smiley.gif\" title=\"Wave\"/>"}, {"username": "drgecko", "date": "31 Mar 2020, 13:47", "content": "Should have sent the Bee Association a strongly worded tweet saying they had blood on their hands.<br/><br/><br/><br/>Do bees have blood?"}, {"username": "Ninjacuts", "date": "31 Mar 2020, 13:47", "content": "<blockquote><div><cite>milomak wrote:</cite><blockquote><div><cite>Snapper wrote:</cite>Part 8 will probably make me unpopular with large sections of the forum so we'll see how that goes.</div></blockquote><br/>by god, you are also a buy to rent landlord  <img alt=\":wave:\" class=\"smilies\" src=\"./images/smilies/wave_smiley.gif\" title=\"Wave\"/> <img alt=\":wave:\" class=\"smilies\" src=\"./images/smilies/wave_smiley.gif\" title=\"Wave\"/> <img alt=\":wave:\" class=\"smilies\" src=\"./images/smilies/wave_smiley.gif\" title=\"Wave\"/></div></blockquote><br/>He'll take all their honey for rent <img alt=\":shocked:\" class=\"smilies\" src=\"./images/smilies/icon_eek.gif\" title=\"Shocked\"/> <img alt=\":wave:\" class=\"smilies\" src=\"./images/smilies/wave_smiley.gif\" title=\"Wave\"/>"}, {"username": "Grifter", "date": "31 Mar 2020, 13:47", "content": "<blockquote><div><cite>drgecko wrote:</cite>Should have sent the Bee Association a strongly worded tweet saying they had blood on their hands.<br/><br/><br/><br/>Do bees have blood?</div></blockquote><br/><br/>No, filled with oil"}, {"username": "Ron Jeremy", "date": "31 Mar 2020, 13:53", "content": "Like fuck i’m prepared to wait until tomorrow for more, give us part 8 now you stupid no-walled bee wanker  <img alt=\":wave:\" class=\"smilies\" src=\"./images/smilies/wave_smiley.gif\" title=\"Wave\"/>"}, {"username": "Tommytonks", "date": "31 Mar 2020, 14:01", "content": "<blockquote><div><cite>Grifter wrote:</cite><blockquote><div><cite>drgecko wrote:</cite>Should have sent the Bee Association a strongly worded tweet saying they had blood on their hands.<br/><br/><br/><br/>Do bees have blood?</div></blockquote><br/><br/>No, filled with oil</div></blockquote><br/><br/>#nobloodforoil"}, {"username": "spurt billy", "date": "31 Mar 2020, 14:08", "content": "Bee mark<br/>Excellent story-telling, on the edge of my seat here  <img alt=\":toppa:\" class=\"smilies\" src=\"./images/smilies/5.gif\" title=\"Toppa\"/>"}, {"username": "KBS", "date": "31 Mar 2020, 14:20", "content": "Can't we have part 8 tonight please?  Please??  <img alt=\":'(\" class=\"smilies\" src=\"./images/smilies/icon_cry.gif\" title=\"Crying or Very Sad\"/> <br/><br/>Unbeelievable tension in this tale."}, {"username": "Snapper", "date": "31 Mar 2020, 14:45", "content": "<blockquote><div><cite>KBS wrote:</cite>Can't we have part 8 tonight please?  Please??  <img alt=\":'(\" class=\"smilies\" src=\"./images/smilies/icon_cry.gif\" title=\"Crying or Very Sad\"/> <br/><br/>Unbeelievable tension in this tale.</div></blockquote><br/><br/>Sorry Kinky, no can do. It's on my laptop which is upstairs. There may be bees up there so I'm too afraid to go get it. Plus I'm too lazy. <br/><br/>4 parts today plus some photos. I think that's enough for one day. <br/><br/>I promise 4 more parts tomorrow and some more photos, and that should be that."}, {"username": "drgecko", "date": "31 Mar 2020, 14:54", "content": "<blockquote><div><cite>Snapper wrote:</cite><blockquote><div><cite>KBS wrote:</cite>Can't we have part 8 tonight please?  Please??  <img alt=\":'(\" class=\"smilies\" src=\"./images/smilies/icon_cry.gif\" title=\"Crying or Very Sad\"/> <br/><br/>Unbeelievable tension in this tale.</div></blockquote><br/><br/>Sorry Kinky, no can do. It's on my laptop which is upstairs. <strong>There may be bees up there</strong> so I'm too afraid to go get it. Plus I'm too lazy. <br/><br/>4 parts today plus some photos. I think that's enough for one day. <br/><br/>I promise 4 more parts tomorrow and some more photos, and that should be that.</div></blockquote><br/><br/><br/>Spoiler ffs  <img alt=\":mad:\" class=\"smilies\" src=\"./images/smilies/icon_mad.gif\" title=\"Mad\"/>"}, {"username": "KBS", "date": "31 Mar 2020, 15:01", "content": "<blockquote><div><cite>drgecko wrote:</cite><blockquote><div><cite>Snapper wrote:</cite><blockquote><div><cite>KBS wrote:</cite>Can't we have part 8 tonight please?  Please??  <img alt=\":'(\" class=\"smilies\" src=\"./images/smilies/icon_cry.gif\" title=\"Crying or Very Sad\"/> <br/><br/>Unbeelievable tension in this tale.</div></blockquote><br/><br/>Sorry Kinky, no can do. It's on my laptop which is upstairs. <strong>There may be bees up there</strong> so I'm too afraid to go get it. Plus I'm too lazy. <br/><br/>4 parts today plus some photos. I think that's enough for one day. <br/><br/>I promise 4 more parts tomorrow and some more photos, and that should be that.</div></blockquote><br/><br/><br/>Spoiler ffs  <img alt=\":mad:\" class=\"smilies\" src=\"./images/smilies/icon_mad.gif\" title=\"Mad\"/></div></blockquote><br/><br/>I think that's teasing a season 2  <img alt=\":o\" class=\"smilies\" src=\"./images/smilies/icon_surprised.gif\" title=\"Surprised\"/>"}, {"username": "neville's 2 weeks", "date": "31 Mar 2020, 15:06", "content": "BM, enjoying this.<br/><br/><br/><br/><br/><br/><br/>Bee careful with your PI here, swap county and that picture of the cottage to cover your tracks somewhat."}, {"username": "Snapper", "date": "31 Mar 2020, 15:46", "content": "<blockquote><div><cite>neville's 2 weeks wrote:</cite>BM, enjoying this.<br/><br/><br/><br/><br/><br/><br/>Bee careful with your PI here, swap county and that picture of the cottage to cover your tracks somewhat.</div></blockquote><br/><br/>That horse has probably bolted tbh. If anyone is arsed I'm sure they can track my address down but I'm not sure why they would bother."}, {"username": "Ellis Carver", "date": "31 Mar 2020, 15:51", "content": "I’m sure nobody here has bad intentions, although some of the brummy forumers might miss bee hive"}, {"username": "CBlue", "date": "31 Mar 2020, 15:59", "content": "<blockquote><div><cite>Snapper wrote:</cite><blockquote><div><cite>neville's 2 weeks wrote:</cite>BM, enjoying this.<br/><br/><br/><br/><br/><br/><br/>Bee careful with your PI here, swap county and that picture of the cottage to cover your tracks somewhat.</div></blockquote><br/><br/>That horse has probably bolted tbh. If anyone is arsed I'm sure they can track my address down but I'm not sure why they would bother.</div></blockquote><br/>True, you only need to either, stop &amp; ask the buzzies or follow any bee."}, {"username": "Yack", "date": "31 Mar 2020, 16:24", "content": "I’ll bee  <img alt=\":picard:\" class=\"smilies\" src=\"./images/smilies/picard.gif\" title=\"Picard\"/> checking this thread again tomorrow for the updates  <img alt=\":o\" class=\"smilies\" src=\"./images/smilies/icon_surprised.gif\" title=\"Surprised\"/>"}, {"username": "KBS", "date": "31 Mar 2020, 16:28", "content": "<blockquote><div><cite>Yack wrote:</cite>I’ll bee  <img alt=\":picard:\" class=\"smilies\" src=\"./images/smilies/picard.gif\" title=\"Picard\"/> checking this thread again tomorrow for the updates  <img alt=\":o\" class=\"smilies\" src=\"./images/smilies/icon_surprised.gif\" title=\"Surprised\"/></div></blockquote><br/><br/>Can't wait. I'm buzzing  <img alt=\":thumbup:\" class=\"smilies\" src=\"./images/smilies/icon_thumbsup.gif\" title=\"Thumb Up\"/>"}, {"username": "links", "date": "31 Mar 2020, 17:05", "content": "Bee-M<br/><br/>There's a bizarre Facebook profile for a Jack Mackerel who is in the nude, covered in blood, singing songs rather aggressively. That's not you, is it?"}, {"username": "Pat Mustard's lovechild", "date": "31 Mar 2020, 17:23", "content": "<blockquote><div><cite>Smith 9 wrote:</cite><blockquote><div><cite>I like traffic lights wrote:</cite>This thread and KI's smack head guerilla army one have really helped to get over corona lock down and bring a bit of a buzz back into our lives</div></blockquote><br/><br/>Mate, you may mock, but those boys deliberately break windows in abandoned building sites, and<em> no-one notices.</em></div></blockquote><br/>Link to KI thread?"}, {"username": "ironmike8", "date": "31 Mar 2020, 17:38", "content": "Beads? <br/><br/>Top thread  <img alt=\":toppa:\" class=\"smilies\" src=\"./images/smilies/5.gif\" title=\"Toppa\"/>"}, {"username": "Snapper", "date": "31 Mar 2020, 18:38", "content": "<blockquote><div><cite>links wrote:</cite>Bee-M<br/><br/>There's a bizarre Facebook profile for a Jack Mackerel who is in the nude, covered in blood, singing songs rather aggressively. That's not you, is it?</div></blockquote><br/><br/>Correct."}, {"username": "Nichael Bluth", "date": "31 Mar 2020, 19:38", "content": "<blockquote><div><cite>Snapper wrote:</cite><blockquote><div><cite>links wrote:</cite>Bee-M<br/><br/>There's a bizarre Facebook profile for a Jack Mackerel who is in the nude, covered in blood, singing songs rather aggressively. That's not you, is it?</div></blockquote><br/><br/>Correct.</div></blockquote><br/><br/> <img alt=\":fergie:\" class=\"smilies\" src=\"./images/smilies/fergie.gif\" title=\"Fergie\"/>"}, {"username": "Savage Gambler", "date": "31 Mar 2020, 19:43", "content": "Sitting here at 1am, alone in my bedroom, genuinely furious about the Bee-Keepers Association."}, {"username": "Septula", "date": "31 Mar 2020, 19:50", "content": "<blockquote><div><cite>Savage Gambler wrote:</cite>Sitting here at 1am, alone in my bedroom, genuinely furious about the Bee-Keepers Association.</div></blockquote><br/>I can't sleep and I'm fuming about the useless bee keeper fuckers more than the fact it's my last day in isolation today before going back to work tomorrow  <img alt=\":lol:\" class=\"smilies\" src=\"./images/smilies/icon_lol.gif\" title=\"lol\"/>"}, {"username": "Poboy", "date": "31 Mar 2020, 22:44", "content": "This is shit.  <img alt=\":thumbdown:\" class=\"smilies\" src=\"./images/smilies/icon_thumbdown.gif\" title=\"Thumb Down\"/>"}, {"username": "Edmund", "date": "01 Apr 2020, 02:26", "content": "Beekeepers rape and murder his wife. Bees take revenge. Bees move in to the other house."}, {"username": "KBS", "date": "01 Apr 2020, 02:38", "content": "<blockquote><div><cite>Poboy wrote:</cite>This is shit.  <img alt=\":thumbdown:\" class=\"smilies\" src=\"./images/smilies/icon_thumbdown.gif\" title=\"Thumb Down\"/></div></blockquote><br/><br/>Your face is shit"}, {"username": "Snapper", "date": "01 Apr 2020, 02:40", "content": "<blockquote><div><cite>Edmund wrote:</cite>Beekeepers rape and murder his wife. Bees take revenge. Bees move in to the other house.</div></blockquote><br/><br/> <img alt=\":uhoh:\" class=\"smilies\" src=\"./images/smilies/icon_uhoh.gif\" title=\"Uh oh\"/><br/><br/>Yeah that's not what happened thankfully."}, {"username": "Snapper", "date": "01 Apr 2020, 03:45", "content": "<strong>Part 8 – The bee-ginning of the end</strong><br/><br/>The next day was a memorable one. Nearly a year later, I can pinpoint the exact date: Wednesday 24th April 2019. How can I be so certain, you ask? The answer is because it was the day of the Manchester derby. United vs City at Old Trafford. City needed to win to go 1 point clear of Liverpool at the top of the league. As a City supporter, it was a big day for me. Oh yeah and it was memorable also because of the bees. <br/><br/>I was nervous all day. I hate derbies anyway, they make me feel sick to my stomach, but the stakes were s high as they had been for any derby game in my lifetime. I’m a simple fellow and hate when I have to be nervous about more than one thing at a time, so the bee situation was really pissing me off. I wished I’d put them off until the following evening but I couldn’t really justify this delaying things for a football match, no matter how important.<br/><br/>Mark and his brother arrived at around 6pm in a new Ford Ranger – it was strange to see what appeared to be a young boy driving such a large vehicle. I also remember thinking to myself that they were arriving at just about the same time that the City squad were arriving at Old Trafford. Heroes one and all, brave gladiators entering a hostile arena. I began to hope that the beekeepers might even be finished and gone before kick-off, as if they were collecting some old furniture. Oh what a fool I was.<br/><br/>I went outside to meet them as they were unpacking their stuff from the flatbed of their truck. They brought the smoker, the hive-frame and some tools upstairs, then came back outside and changed into their beekeeper suits. They paused a moment, nodded to each other once in steely resolve, and walked back into the house. I can still remember them – a vision in their bright-white outfits, netted beekeeping hats tucked under one arm. They were like a couple of little white supremacist firemen.<br/><br/>I went upstairs with them to see if they needed anything before they started. They said they didn’t. They were all set. Good to go. I told them I’d be downstairs watching the match if they needed me. “What match?” Mark asked. Fucking kids today  <img alt=\":roll:\" class=\"smilies\" src=\"./images/smilies/icon_rolleyes.gif\" title=\"Roll eyes\"/> <br/><br/>I settled down to watch the pre-game build-up. I was a nervous wreck anyway, but this really wasn’t helped by the banging noises which began to emanate from upstairs. I tried to ignore them as best I could. They became louder still. I put my fingers in my ears but it did no good. I could still hear them and it was unsettling, every bang made my heart jump in my chest. Then there was one incredibly loud bang. The walls shook. Birds were startled from the trees outside. I waited. Silence. I waited a bit longer. Nothing. I crept back upstairs. I inched the bedroom door open. I listened. Nothing. I began to poke my head inside. “Everything OK?” I started to ask. “Fine, fine, everything’s fine!” they shrieked. “Just don’t come in, it’s not safe!” That’s all I needed to hear. You don’t need to tell me twice to stay out of an unsafe room with bees in it. I slammed the door and hot-tailed it back down the stairs. <br/><br/>An hour or so later and I hadn’t seen or heard from them since. A goalless first half hadn’t helped my nerves. My palms were sweating. I felt like throwing up. The second half started. Ten minutes or so into the half, a buzzing (lol) Bernardo Silva picked up the ball on the right hand side. He cut inside onto his left and hit a shot that beat De Gea at his near post. I let out a roar of delight and danced around the room. Moments later, Mark poked his head in the room. “Everything OK?” he asked. I reassured him that everything was fine. Brilliant in fact. <br/><br/>I could see that the poor lad was sweating buckets in his suit, it poured down his face. I told him to go get his brother - they clearly needed to take a break. As they guzzled down water, I asked how things were going. They told me that it was going OK - they’d had some trouble getting access to the hive (hence the banging) but they were in there now and were busy smoking the bees into a stupor. Once that was done, they would transfer the bees into the trays, lock them into the frame and be on their way. I had a few more questions, but just then, Leroy Sane doubled City’s lead with a stinging (lol) shot that crept under De Gea, and for a few glorious seconds I forgot all about bees."}, {"username": "JStand23", "date": "01 Apr 2020, 03:46", "content": "<blockquote><div><cite>Edmund wrote:</cite>Beekeepers rape and murder his wife. Bees take revenge. Bees move in to the other house.</div></blockquote><br/>That is disgusting prick"}, {"username": "KBS", "date": "01 Apr 2020, 03:57", "content": "<img alt=\"Image\" class=\"postimage\" src=\"https://i.imgflip.com/3uwe9i.jpg\"/>"}, {"username": "Mujo", "date": "01 Apr 2020, 03:58", "content": "<blockquote><div><cite>Snapper wrote:</cite><blockquote><div><cite>Edmund wrote:</cite>Beekeepers rape and murder his wife. Bees take revenge. Bees move in to the other house.</div></blockquote><br/><br/> <img alt=\":uhoh:\" class=\"smilies\" src=\"./images/smilies/icon_uhoh.gif\" title=\"Uh oh\"/><br/><br/>Yeah that's not what happened thankfully.</div></blockquote><br/><br/>Wouldn't want them in <em>another</em> house."}, {"username": "DMC-12", "date": "01 Apr 2020, 04:00", "content": "I've enjoyed this so far  <img alt=\":thumbup:\" class=\"smilies\" src=\"./images/smilies/icon_thumbsup.gif\" title=\"Thumb Up\"/> <br/><br/>I still hope the big reveal is that you bought an enormous beehive with a small cottage attached."}, {"username": "Snapper", "date": "01 Apr 2020, 04:05", "content": "<blockquote><div><cite>KBS wrote:</cite><img alt=\"Image\" class=\"postimage\" src=\"https://i.imgflip.com/3uwe9i.jpg\"/></div></blockquote><br/><br/>Good one  <img alt=\":smug:\" class=\"smilies\" src=\"./images/smilies/icon_smug.gif\" title=\"Smug\"/>"}, {"username": "Ellis Carver", "date": "01 Apr 2020, 04:21", "content": "<blockquote><div><cite>DMC-12 wrote:</cite>I've enjoyed this so far  <img alt=\":thumbup:\" class=\"smilies\" src=\"./images/smilies/icon_thumbsup.gif\" title=\"Thumb Up\"/> <br/><br/>I still hope the big reveal is that you bought an enormous beehive with a small cottage attached.</div></blockquote><br/>And he checks the land registry to find out it was originally owned and built by Cecil bee da mill  <img alt=\":o\" class=\"smilies\" src=\"./images/smilies/icon_surprised.gif\" title=\"Surprised\"/>"}, {"username": "dizzy_rascal", "date": "01 Apr 2020, 04:22", "content": "<blockquote><div><cite>KBS wrote:</cite><img alt=\"Image\" class=\"postimage\" src=\"https://i.imgflip.com/3uwe9i.jpg\"/></div></blockquote><br/>Don't think they're German bees mate."}, {"username": "TheInformer", "date": "01 Apr 2020, 04:22", "content": "<blockquote><div><cite>Poboy wrote:</cite>This is shit.  <img alt=\":thumbdown:\" class=\"smilies\" src=\"./images/smilies/icon_thumbdown.gif\" title=\"Thumb Down\"/></div></blockquote><br/>You are shit."}, {"username": "KBS", "date": "01 Apr 2020, 04:27", "content": "<blockquote><div><cite>TheInformer wrote:</cite><blockquote><div><cite>Poboy wrote:</cite>This is shit.  <img alt=\":thumbdown:\" class=\"smilies\" src=\"./images/smilies/icon_thumbdown.gif\" title=\"Thumb Down\"/></div></blockquote><br/>You are shit.</div></blockquote><br/><br/>Poboy hates everything about Ireland and the Irish.<br/><br/>If this was set in leafy hampshire, he would be all over it  <img alt=\":nod:\" class=\"smilies\" src=\"./images/smilies/icon_nod.gif\" title=\"Nod\"/>"}, {"username": "Pelicans", "date": "01 Apr 2020, 04:29", "content": "<img alt=\":toppa:\" class=\"smilies\" src=\"./images/smilies/5.gif\" title=\"Toppa\"/>  story so far is excellent."}, {"username": "Major Disappointment", "date": "01 Apr 2020, 04:36", "content": "You have a real talent, thoroughly enjoying this  <img alt=\":thumbup:\" class=\"smilies\" src=\"./images/smilies/icon_thumbsup.gif\" title=\"Thumb Up\"/>"}, {"username": "Flashguns", "date": "01 Apr 2020, 04:56", "content": "BM!  <img alt=\":thumbup:\" class=\"smilies\" src=\"./images/smilies/icon_thumbsup.gif\" title=\"Thumb Up\"/>"}, {"username": "lynbod", "date": "01 Apr 2020, 05:02", "content": "Wait just one cotton picking fucking minute, you're a fucking Irish City fan?<br/><br/>GTFO<br/><br/>#teambee"}, {"username": "Lad O'Banter", "date": "01 Apr 2020, 05:02", "content": "bm"}, {"username": "Snapper", "date": "01 Apr 2020, 05:49", "content": "<blockquote><div><cite>lynbod wrote:</cite>Wait just one cotton picking fucking minute, you're a fucking Irish City fan?<br/><br/>GTFO<br/><br/>#teambee</div></blockquote><br/><br/>Oh no, do you think less of me?  <img alt=\":(\" class=\"smilies\" src=\"./images/smilies/icon_sad.gif\" title=\"Sad\"/>"}, {"username": "Snapper", "date": "01 Apr 2020, 05:56", "content": "<strong>Part 9 – The suitcase</strong><br/><br/>As I celebrated, my questions were forgotten and would remain forever unasked and thus unanswered. The two lads trudged back upstairs and got back down to it. City saw out the game for a precious 3 points. I sat on the couch, happy with the victory, but conscious that there were still two rookie young beekeepers toiling away in the master bedroom. That knowledge made it hard to fully relax and enjoy the moment.<br/><br/>Finally, at around 11pm, they emerged from the bedroom and trundled downstairs. As they packed the hive-frame into the truck, they told me that they had removed most of the bees, but would need to return the next day to finish up as there were still “a few” bees up there.<br/><br/>I asked whether the room was off-limits. I’m not sure what kind of state I thought it would be in but I still harboured faint hopes for a clean bee removal. They exchanged a furtive glance. “Yeah, probably best to stay out of there tonight… and keep the door closed”. Although this didn’t fill me with confidence, it was late and I thought it best to let the poor fuckers go get some sleep and come back refreshed the next day. We could sleep in the spare room for one night, it wouldn’t kill us.<br/><br/>As soon as they left, my wife emerged from wherever she had been hiding to see what the story was. I explained the situation and her brow furrowed. “But I need to pack my suitcase” she said. Shit. She was right. She had to catch a flight first thing the next morning, she was going to Prague for work. Her suitcase and all of her clothes were in the master bedroom. I suggested calling the Beekeeping Bros to come back and fetch some items for her, but she wasn’t comfortable with that, which was fair enough really. In a rare show of bravery, I told her to make a list of what she needed and I would go in there and get it. “I mean, how bad can it BEE in there?” I quipped nervously.<br/><br/>As she set about drawing up her list, I set about fashioning myself a home-made beekeeping outfit. I figured the premise is a simple one – you just have minimise exposed skin, right? I rooted out a beanie hat, some gloves, a hoodie. I tucked everything into everything - trousers into socks, hoodie sleeves into gloves, my penis into my clenched upper thighs (why take any chances). I put the beanie on my head, wrapped a scarf over my mouth and pulled the drawstrings on the hood tight. My eyes and nose were still exposed but this was the best I could do. It’s not like they are important parts of the human anatomy anyway. Humans can survive with just 3 senses. I grabbed the list and headed up the stairs in trepidation.<br/><br/>I’ve prepared another MS Paint picture, this time a map of the bedroom: <br/><br/><img alt=\"Image\" class=\"postimage\" src=\"https://i.imgur.com/ZN2QF0P.jpg\"/><br/><br/>I quickly ran through a strategy in my head. My plan was as follows: <br/>•\tEnter through the door (standard). <br/>•\tClose the door to avoid bee leakage.<br/>•\tShimmy my way to the left, over to my wife’s wardrobe. I figured that shimmying was my best bet to avoid the ire of the bees. They wouldn’t be used to a shimmy and I wanted to keep them on the backfoot. Plus I’ve always been a good shimmier.<br/>•\tTake the suitcase from the wardrobe. <br/>•\tPack the suitcase with clothes as per the list. <br/>•\tShimmy my way to the en-suite. <br/>•\tCollect toiletries as per the list. <br/>•\tShimmy my way back to the door.<br/>•\tExit through the door (again, standard). <br/>•\tClose the door behind me.<br/><br/>I would also try to avoid the area marked “Here be bees” at all times, as I felt it was most likely that this was where the bees would be. <br/><br/>At the top of the stairs, I paused for a moment to steady myself and gather my thoughts. I took a deep breath and reached for the door handle."}, {"username": "KBS", "date": "01 Apr 2020, 06:02", "content": "\"Here be bees\"  <img alt=\":lol:\" class=\"smilies\" src=\"./images/smilies/icon_lol.gif\" title=\"lol\"/>"}, {"username": "Geoff", "date": "01 Apr 2020, 06:04", "content": "tension mounts"}, {"username": "SuperTomasRepka", "date": "01 Apr 2020, 06:09", "content": "<img alt=\"Image\" class=\"postimage\" src=\"https://66.media.tumblr.com/16b9a010ea7f5ffe11bcb6152390d236/tumblr_mpxh8aR9LA1rcaggdo1_1280.gif\"/>"}, {"username": "ramboII", "date": "01 Apr 2020, 06:23", "content": "that is some cliffhanger. i need part 10 immediately."}, {"username": "Skinny Pete", "date": "01 Apr 2020, 06:27", "content": "I mean, its a decent diagram and everything, but its just not quite as good as the one in the pigeon crimescene thread."}, {"username": "milomak", "date": "01 Apr 2020, 06:31", "content": "<blockquote><div><cite>Snapper wrote:</cite><strong>Part 9 – The suitcase</strong><br/>As soon as they left, my wife emerged from wherever she had been hiding to see what the story was. I explained the situation and her brow furrowed. “But I need to pack my suitcase” she said. Shit. She was right. She had to catch a flight first thing the next morning, she was going to Prague for work. Her suitcase and all of her clothes were in the master bedroom.</div></blockquote><br/>the best of plans are often derailed by small detail like this"}, {"username": "Valencia", "date": "01 Apr 2020, 06:33", "content": "Shimmying <img alt=\":dance:\" class=\"smilies\" src=\"./images/smilies/7.gif\" title=\"Dance\"/><br/><br/>Anyway come on finish the story don't leave us hanging too long <img alt=\":wave:\" class=\"smilies\" src=\"./images/smilies/wave_smiley.gif\" title=\"Wave\"/>"}, {"username": "billyidd0", "date": "01 Apr 2020, 06:41", "content": "Dragged this one out fucking hell"}, {"username": "beefheart", "date": "01 Apr 2020, 06:46", "content": "<blockquote><div><cite>billyidd0 wrote:</cite>Dragged this one out fucking hell</div></blockquote><br/><br/>Fuck off!<br/><br/>This is literally the best thing in the world right now"}, {"username": "OperationGoodisonExercise", "date": "01 Apr 2020, 06:47", "content": "<blockquote><div><cite>billyidd0 wrote:</cite>Dragged this one out fucking hell</div></blockquote><br/>Got loads on have you?"}, {"username": "Snapper", "date": "01 Apr 2020, 07:12", "content": "<blockquote><div><cite>OperationGoodisonExercise wrote:</cite><blockquote><div><cite>billyidd0 wrote:</cite>Dragged this one out fucking hell</div></blockquote><br/>Got loads on have you?</div></blockquote><br/><br/> <img alt=\":lol:\" class=\"smilies\" src=\"./images/smilies/icon_lol.gif\" title=\"lol\"/> <br/><br/>In the 19th century, Dickens used to release his novels in serialisation, often with a month-long gap between installments. Such was the fervour to find out what happened next that large crowds used to gather at the docks in New York when the latest chapters arrived on a boat from England.<br/><br/>I'm sure you can stand to wait in the comfort of your own home for a couple of hours before the next part arrives electronically onto your preferred computing device.<br/><br/>And yes, I do consider myself to be the Charles Dickens of the forum."}, {"username": "Jebus", "date": "01 Apr 2020, 07:24", "content": "<blockquote><div><cite>Snapper wrote:</cite><blockquote><div><cite>OperationGoodisonExercise wrote:</cite><blockquote><div><cite>billyidd0 wrote:</cite>Dragged this one out fucking hell</div></blockquote><br/>Got loads on have you?</div></blockquote><br/><br/> <img alt=\":lol:\" class=\"smilies\" src=\"./images/smilies/icon_lol.gif\" title=\"lol\"/> <br/><br/>In the 19th century, Dickens used to release his novels in serialisation, often with a month-long gap between installments. Such was the fervour to find out what happened next that large crowds used to gather at the docks in New York when the latest chapters arrived on a boat from England.<br/><br/>I'm sure you can stand to wait in the comfort of your own home for a couple of hours before the next part arrives electronically onto your preferred computing device.<br/><br/>And yes, I do consider myself to be the Charles Dickens of the forum.</div></blockquote><br/><br/>You ARE the Charles Dickens of the forum &amp; I will fight anyone who says otherwise"}, {"username": "CarTree", "date": "01 Apr 2020, 07:28", "content": "I hope your wife put “some bees” on her list for the lols"}, {"username": "Fundamentals", "date": "01 Apr 2020, 07:35", "content": "A great ending to this story will make all the mediocre writing and superfluous chapters worth it. Bring it home OP."}, {"username": "Mini", "date": "01 Apr 2020, 07:35", "content": "<blockquote><div><cite>Snapper wrote:</cite><strong>Part 9 – The suitcase</strong><br/><img alt=\"Image\" class=\"postimage\" src=\"https://i.imgur.com/ZN2QF0P.jpg\"/><br/><br/>I quickly ran through a strategy in my head. My plan was as follows: <br/>•\tEnter through the door (standard). <br/>•\tClose the door to avoid bee leakage.<br/>•\tShimmy my way to the left, over to my wife’s wardrobe. I figured that shimmying was my best bet to avoid the ire of the bees. They wouldn’t be used to a shimmy and I wanted to keep them on the backfoot. Plus I’ve always been a good shimmier.<br/>•\tTake the suitcase from the wardrobe. <br/>•\tPack the suitcase with clothes as per the list. <br/>•\tShimmy my way to the en-suite. <br/>•\tCollect toiletries as per the list. <br/>•\tShimmy my way back to the door.<br/>•\tExit through the door (again, standard). <br/>•\tClose the door behind me.<br/><br/>I would also try to avoid the area marked “Here be bees” at all times, as I felt it was most likely that this was where the bees would be. <br/><br/>At the top of the stairs, I paused for a moment to steady myself and gather my thoughts. I took a deep breath and reached for the door handle.</div></blockquote><br/><br/>I realise this is all in the past but in my head I'm screaming \"Chirst! dont go over to the ensuite!!\"   <img alt=\":uhoh:\" class=\"smilies\" src=\"./images/smilies/icon_uhoh.gif\" title=\"Uh oh\"/>"}, {"username": "Ari", "date": "01 Apr 2020, 07:43", "content": "The high pitched buzzing would drive me insane, my skin crawls just thinking of it. Takes a braver man than me to put up with the Cork accent full time"}, {"username": "CarTree", "date": "01 Apr 2020, 08:03", "content": "<blockquote><div><cite>Fundamentals wrote:</cite>A great ending to this story will make all the mediocre writing and superfluous chapters worth it. Bring it home OP.</div></blockquote><br/> <img alt=\":yawn:\" class=\"smilies\" src=\"./images/smilies/icon_yawn.gif\" title=\"Yawn\"/>"}, {"username": "Darwen Joe", "date": "01 Apr 2020, 08:05", "content": "<blockquote><div><cite>Snapper wrote:</cite><blockquote><div><cite>OperationGoodisonExercise wrote:</cite><blockquote><div><cite>billyidd0 wrote:</cite>Dragged this one out fucking hell</div></blockquote><br/>Got loads on have you?</div></blockquote><br/><br/> <img alt=\":lol:\" class=\"smilies\" src=\"./images/smilies/icon_lol.gif\" title=\"lol\"/> <br/><br/>In the 19th century, Dickens used to release his novels in serialisation, often with a month-long gap between installments. Such was the fervour to find out what happened next that large crowds used to gather at the docks in New York when the latest chapters arrived on a boat from England.<br/><br/>I'm sure you can stand to wait in the comfort of your own home for a couple of hours before the next part arrives electronically onto your preferred computing device.<br/><br/>And yes, I do consider myself to be the Charles Dickens of the forum.</div></blockquote><br/><br/>Charles Dickens wrote under the name of \"Boz\", fact.<br/><br/> I presume you'll be updating that to \"Buzz\"."}, {"username": "Poboy", "date": "01 Apr 2020, 08:09", "content": "<blockquote><div><cite>KBS wrote:</cite><blockquote><div><cite>TheInformer wrote:</cite><blockquote><div><cite>Poboy wrote:</cite>This is shit.  <img alt=\":thumbdown:\" class=\"smilies\" src=\"./images/smilies/icon_thumbdown.gif\" title=\"Thumb Down\"/></div></blockquote><br/>You are shit.</div></blockquote><br/><br/>Poboy hates everything about Ireland and the Irish.<br/><br/>If this was set in leafy hampshire, he would be all over it  <img alt=\":nod:\" class=\"smilies\" src=\"./images/smilies/icon_nod.gif\" title=\"Nod\"/></div></blockquote><br/>True dat."}, {"username": "Smith 9", "date": "01 Apr 2020, 08:10", "content": "Beginning to remind me of that film in which someone lets their flat to a group of crooks who absolutely tear the place up, all the while protected by the law. Just can't recall the name."}, {"username": "Kid_Amnesiac", "date": "01 Apr 2020, 08:10", "content": "This is great"}, {"username": "Snapper", "date": "01 Apr 2020, 08:20", "content": "<strong>Part 10 – Shitting myself</strong><br/><br/>A couple of things occur to me now as I write this tale. Firstly, Mike Tyson famously said that “everybody has a plan until they get punched in the mouth.” In other words, plans “gang aft agley”. Not my words, Michael, the words of Robert Burns.<br/><br/>The second thing I am thinking about is numbers. I have always liked numbers. They’re both definite and yet curiously flexible. Numbers can overwhelm us - for example, how the rising numbers of deaths in a virus outbreak quickly lose meaning, as we struggle to comprehend the scale of human tragedy. They can also underwhelm - for example, the length of a man’s penis in comparison to those of his peers. It fascinates me how the same number can seem huge or tiny depending on context.<br/><br/>You might remember how at the beginning of this saga, I told you how the electrician had said that there were “a load of fucking bees” in the bedroom, and how this was his description for what was, at most, a couple of dozen bees. It may not surprise you that when Mark told me that there were a still “a few” bees left in my bedroom, he was using a different scale of measurement entirely.<br/><br/>I reached into the room with one gloved hand and flicked the lights on. I stepped into the room. Even with the beanie hat on and the hood pulled tight, the noise was incredible. The sound of thousands of tiny wings beating hummed and throbbed through the night. <br/><br/>Although my field of vision was reduced by the tight hood, I could see that there were a lot of fucking bees in the room. A lot of fucking bees. Certainly more than what anyone could reasonably describe as “a few”. A thick brown buzzing haze hung in the far corner. And you know what? My  fucking map was wrong! Although numbers were more concentrated in the corner, they weren’t staying in one place. They were everywhere. A bee be here, and a bee be there, here a bee, there a bee, everywhere a bee be. They were on the walls. They were on the ceiling. They were on the floor. They were – shit! They were on me! I had bees on me! <br/><br/>I realised that I was close to losing it, so I tried to focus on the plan. “Shimmy” I said to myself. “Just shimmy and it will all be OK”. This helped clear my mind a little bit, and I closed the door behind me. I inched left to the wardrobe and opened it. I retrieved the suitcase, silently thanking my wife for her clear instructions on where everything was. <br/><br/>I turned to put the suitcase on the bed in order to pack it, but the sight of the bed stopped me in my tracks. My bed belonged to the bees now. I would have to hold the suitcase in one hand and throw stuff into it with the other.<br/><br/>I ran through the list of clothing as quickly as I could, taking care not to forget anything. There was no way I would be able to do this a second time. The task of packing helped to take my mind off the bees for a little while. It helped that I had my back to the room. The noise was still there, a constant thrum, but there weren’t many bees in view. I’m not saying I forgot that they were there entirely, but I was able to get through the list item by item.<br/><br/>Eventually, I got everything into the suitcase and slid the wardrobe door closed. The next thing to do was shimmy to the en-suite to get some toiletries. As I turned from the wardrobe, I remember a sudden realisation that the light in the room had changed as I was packing. It was a lot darker now, and the light had an eerie shimmering quality. I have exaggerated for effect in this story at times but I am not exaggerating when I say that what I saw next still haunts my dreams. <br/><br/>The bedroom is lit by a dozen or so downlights, which are recessed into the ceiling. When I had switched on the lights as I entered the room, either the light or the heat (or both) had begun to attract the bees. And as I had been packing, oblivious to what was happening behind me, the bees had been gathering.<br/><br/>There were now a dozen thick ropes of bees hanging from my bedroom ceiling. These bee stalactites varied in length but all were at least a foot long. They were maybe six inches in diameter at the top, and tapered towards the bottom. The ceiling in the bedroom is low, which meant that the tip of the one nearest to me was dangling just a couple of feet from my face. <br/><br/>The fear of insects is known as Entomophobia. More specifically, there is a fear of bees, which is Apiphobia. I don’t suffer from either thankfully. In fact, I don’t know that I suffer from any phobias. However, I have also heard of Trypophobia, which is aversion to the sight of irregular clusters, for example clusters of small holes or bumps. Sufferers often describe a feeling of disgust when they look at clusters of insects. I can relate to this.<br/><br/>There was something incredibly disturbing and repulsive about these horrifying bee formations. They seemed solid, and yet it was clear that they were just the sum of hundreds of tiny, separate parts, all motivated by the same thing. They were constantly in motion, as bees crawled over one another in search of more warmth, more light. They were almost reptilian in form, like dark brown tentacles blindly reaching down, as if searching for prey. I remember thinking that if one of them touched the exposed skin on my face, it would stick to my flesh and start to consume me. They were quite clearly alive and yet made me think only of decay. It was a bit shit if I’m honest.<br/><br/>I am not ashamed to admit that I lost my nerve at this point. Fuck the en-suite, I thought, she can buy some new toiletries for her trip. I quickly shimmied to the door, opened it, and shimmied out of the room, remembering to flick off the light before I closed the door behind me. I stumbled down the stairs and ran out the front door into the warm April night. I shook myself like a wet dog for a good five minutes, to rid myself of any bees that were still clinging to me.<br/><br/>When I was done, my wife examined me from afar with a high-beam torch, to make sure I was bee-free. Then she let me back into the house. It was after midnight now. She had an early flight the next morning. We went into the spare room and we got into bed. I lay there staring at the ceiling, adrenaline coursing through my veins. It was nearly light before I finally fell asleep."}, {"username": "Geoff", "date": "01 Apr 2020, 08:23", "content": "<img alt=\":scared:\" class=\"smilies\" src=\"./images/smilies/scared.png\" title=\"Scared\"/>"}, {"username": "OperationGoodisonExercise", "date": "01 Apr 2020, 08:24", "content": "Did you get stang off any of these bees?"}, {"username": "Mujo", "date": "01 Apr 2020, 08:28", "content": "Fucking hell  <img alt=\":lol:\" class=\"smilies\" src=\"./images/smilies/icon_lol.gif\" title=\"lol\"/> <img alt=\":lol:\" class=\"smilies\" src=\"./images/smilies/icon_lol.gif\" title=\"lol\"/> <img alt=\":lol:\" class=\"smilies\" src=\"./images/smilies/icon_lol.gif\" title=\"lol\"/> <br/><br/>Brilliant writing fella."}, {"username": "bluenewt", "date": "01 Apr 2020, 08:30", "content": "I don't get why you were packing the clothes in the room, just grab it all and hoy it out <img alt=\":lol:\" class=\"smilies\" src=\"./images/smilies/icon_lol.gif\" title=\"lol\"/>"}, {"username": "SuperTomasRepka", "date": "01 Apr 2020, 08:30", "content": "I might never sleep again <img alt=\":scared:\" class=\"smilies\" src=\"./images/smilies/scared.png\" title=\"Scared\"/>"}, {"username": "spurt billy", "date": "01 Apr 2020, 08:31", "content": "<blockquote class=\"uncited\"><div> I lay there staring at the ceiling, adrenaline coursing through my veins. It was nearly light before I finally fell asleep.</div></blockquote><br/><strong>Turn to page 48.</strong>"}, {"username": "ramboII", "date": "01 Apr 2020, 08:31", "content": "<img alt=\"Image\" class=\"postimage\" src=\"https://media.giphy.com/media/TW8Ma1a8ZsZ8I/giphy.gif\"/>"}, {"username": "BrumSpur", "date": "01 Apr 2020, 08:32", "content": "Spoilers for pt 11<br/><br/><div style=\"padding: 1px; font-size: 1em;\"><div style=\"text-transform: uppercase; border-bottom: 1px solid #CCCCCC; margin-bottom: 0px; font-size: 0.8em; font-weight: bold; display: block;\"><span onclick=\"if (this.parentNode.parentNode.getElementsByTagName('div')[1].getElementsByTagName('div')[0].style.display != '') {  this.parentNode.parentNode.getElementsByTagName('div')[1].getElementsByTagName('div')[0].style.display = ''; this.innerHTML = '&lt;b&gt;Spoiler: &lt;/b&gt;&lt;a href=\\'#\\' onclick=\\'return false;\\'&gt;hide&lt;/a&gt;'; } else { this.parentNode.parentNode.getElementsByTagName('div')[1].getElementsByTagName('div')[0].style.display = 'none'; this.innerHTML = '&lt;b&gt;Spoiler: &lt;/b&gt;&lt;a href=\\'#\\' onclick=\\'return false;\\'&gt;show&lt;/a&gt;'; }\"></span><b>Spoiler: </b><a href=\"#\" onclick=\"return false;\">show</a></div></div>"}, {"username": "Cachonding Hispalis", "date": "01 Apr 2020, 08:35", "content": "Got 9 and 10 ten look forward to now. Have delayed delivery of a translation by an hour for this. So...."}, {"username": "Alligator", "date": "01 Apr 2020, 08:38", "content": "That was fucking great Snapper.  <img alt=\":adore:\" class=\"smilies\" src=\"./images/smilies/adore.gif\" title=\"Adore\"/>"}, {"username": "CarTree", "date": "01 Apr 2020, 08:39", "content": "<blockquote><div><cite>spurt billy wrote:</cite><blockquote class=\"uncited\"><div> I lay there staring at the ceiling, adrenaline coursing through my veins. It was nearly light before I finally fell asleep.</div></blockquote><br/><strong>Turn to page 48.</strong></div></blockquote><br/> <img alt=\":lol:\" class=\"smilies\" src=\"./images/smilies/icon_lol.gif\" title=\"lol\"/>"}, {"username": "KBS", "date": "01 Apr 2020, 08:45", "content": "That is fucking terrifying  <img alt=\":lol:\" class=\"smilies\" src=\"./images/smilies/icon_lol.gif\" title=\"lol\"/><br/><br/> <img alt=\":scared:\" class=\"smilies\" src=\"./images/smilies/scared.png\" title=\"Scared\"/>"}, {"username": "Ellis Carver", "date": "01 Apr 2020, 08:58", "content": "OB has done a brilliant job here. Been looking forward to and savouring every chapter"}, {"username": "Grifter", "date": "01 Apr 2020, 08:59", "content": "Holy fuck. NOPE."}, {"username": "Richard Keys' keys", "date": "01 Apr 2020, 09:00", "content": "Just read this thread in one go and cannot wait to hear the next instalment. <br/><br/>Fuckin bees  <img alt=\":lol:\" class=\"smilies\" src=\"./images/smilies/icon_lol.gif\" title=\"lol\"/>"}, {"username": "Tsunami", "date": "01 Apr 2020, 09:11", "content": "<blockquote><div><cite>Jebus wrote:</cite><blockquote><div><cite>Snapper wrote:</cite><blockquote><div><cite>OperationGoodisonExercise wrote:</cite><blockquote><div><cite>billyidd0 wrote:</cite>Dragged this one out fucking hell</div></blockquote><br/>Got loads on have you?</div></blockquote><br/><br/> <img alt=\":lol:\" class=\"smilies\" src=\"./images/smilies/icon_lol.gif\" title=\"lol\"/> <br/><br/>In the 19th century, Dickens used to release his novels in serialisation, often with a month-long gap between installments. Such was the fervour to find out what happened next that large crowds used to gather at the docks in New York when the latest chapters arrived on a boat from England.<br/><br/>I'm sure you can stand to wait in the comfort of your own home for a couple of hours before the next part arrives electronically onto your preferred computing device.<br/><br/>And yes, I do consider myself to be the Charles Dickens of the forum.</div></blockquote><br/><br/>You ARE the Charles Dickens of the forum &amp; I will fight anyone who says otherwise</div></blockquote><br/><br/>More like Shakespeare IMO. To bee or not to bee."}, {"username": "FattyMc", "date": "01 Apr 2020, 09:20", "content": "In"}, {"username": "Skinny Pete", "date": "01 Apr 2020, 09:24", "content": "This is a truly excellent tale, but I can't help but feel it should have been live-forummed at the time. We'd have had so many good ideas to help <span style=\"color: #FFFFFF\">make it even more entertaing for us, of course</span>"}, {"username": "Barbour of Seville", "date": "01 Apr 2020, 09:27", "content": "Awesome. IN"}, {"username": "Savage Gambler", "date": "01 Apr 2020, 09:29", "content": "<strong>IN </strong>for a suitcase full of bees exploding open at the airport  <img alt=\":thumbup:\" class=\"smilies\" src=\"./images/smilies/icon_thumbsup.gif\" title=\"Thumb Up\"/>"}, {"username": "justme2009", "date": "01 Apr 2020, 09:32", "content": "<blockquote><div><cite>Ari wrote:</cite>The high pitched buzzing would drive me insane, my skin crawls just thinking of it. Takes a braver man than me to put up with the Cork accent full time</div></blockquote><br/><br/> <img alt=\":lol:\" class=\"smilies\" src=\"./images/smilies/icon_lol.gif\" title=\"lol\"/>"}, {"username": "Snapper", "date": "01 Apr 2020, 09:34", "content": "<strong>Part 11– The Aftermath</strong><br/><br/>The next morning, my wife left for the airport with her suitcase in hand. Later that night, she called me from her hotel room in Prague and she told me that she had (rather predictably) discovered a dozen or so dead bees scattered amongst her clothes as she was unpacking. “Sorry”, I said. “I meant to CZECH for those before you left.” She hung up.<br/><br/>Mark arrived back at around 9am the morning after, only this time he was on his own. He filled me in further on how things had gone for them the night before. They’d opened up the wall and found the hive, which was tucked in the corner of the two external walls. It proved quite tricky to get to, so they’d needed to remove a whole section of the surround and he apologised as he felt it was probably beyond repair. <br/><br/>He said that there were far more bees in the wall than they had anticipated. Once they had subdued them with the smoke, they had started to transfer them into the hive-frames, but it quickly became apparent that they wouldn’t have enough capacity to remove all of the bees in a single visit. I wanted to ask why they hadn’t shared this information with me the night before, but I bit my tongue. To be fair, they had warned me against going into the bedroom, even if they had slightly understated the bee numbers that were still in the house.<br/><br/>Mark’s brother was currently at home, busy transferring the previous night’s haul into their hive. “You’re gonna need a bigger hive”, I said in my best Chief Brody impression. He looked at me blankly. Fucking kids. Anyway, he explained that he had returned with the smoker and another set of frames to gather up the rest of the bees. He set about doing this and I left him to it.<br/><br/>He finished up at around 11am, at which point he estimated they’d removed around 15,000 bees from my walls in total. I asked him if it was safe to go into the bedroom. He said that it was, and we went up together. “There are still some stragglers”, he warned as we entered the room. Oh fuck me, I thought, here we go again. But stragglers is all there were, with maybe twenty or so bees buzzing around the room. The windows were open now, and they bumped their way around the room until finally they each found their way outside. The bedroom was finally bee-free.<br/><br/>Bee-free, but in an awful fucking state. My face must have given me away. “Yeah,” said Mark sheepishly. “It is a bit of a mess, sorry about that”. I said not to worry about it. We went downstairs and I shook his hand. I gave him a couple of hundred euro for his time and effort even though he tried repeatedly to refuse this. He was happy just to have the bees, but I felt he’d earned it and I insisted he take it. I suggested he use it to buy his new hive and he agreed to do this.<br/><br/>He was a hero, was Mark. He got rid of my bees as promised, when a more experienced beekeeper had let me down and the Beekeeper’s Association had hung me out to dry. Despite my reservations about his age, he became my saviour, my saint, my bee-con of hope in a time of crisis. I just wished I’d asked him in advance what precautions one takes when preparing a room for a bee removal operation.<br/><br/>You see, I’d taken no precautions. If I’d known what was about to happen, I would have removed whatever furniture I could – bedside lockers, dresser, chest of drawers. I would have removed the curtains. I would have taken the bedclothes and the mattress from the bed. I did none of those things. <br/><br/>There was brown beeswax dotted on every surface – walls, floor and ceiling. The bed in particular looked like it had been used in a dirty protest, the bedsheets having been the most porous surface that the bees had been in contact with. The curtains and bedding were acrid with the smell of smoke. The floor was sticky with honey and wax. Which brings me to the honey shots you have all been waiting for. <br/><br/>This is what remained of the section of surround they removed. You can see why Mark felt it was “probably beyond repair”:<br/><div style=\"padding: 1px; font-size: 1em;\"><div style=\"text-transform: uppercase; border-bottom: 1px solid #CCCCCC; margin-bottom: 0px; font-size: 0.8em; font-weight: bold; display: block;\"><span onclick=\"if (this.parentNode.parentNode.getElementsByTagName('div')[1].getElementsByTagName('div')[0].style.display != '') {  this.parentNode.parentNode.getElementsByTagName('div')[1].getElementsByTagName('div')[0].style.display = ''; this.innerHTML = '&lt;b&gt;Spoiler: &lt;/b&gt;&lt;a href=\\'#\\' onclick=\\'return false;\\'&gt;hide&lt;/a&gt;'; } else { this.parentNode.parentNode.getElementsByTagName('div')[1].getElementsByTagName('div')[0].style.display = 'none'; this.innerHTML = '&lt;b&gt;Spoiler: &lt;/b&gt;&lt;a href=\\'#\\' onclick=\\'return false;\\'&gt;show&lt;/a&gt;'; }\"></span><b>Spoiler: </b><a href=\"#\" onclick=\"return false;\">show</a></div></div>"}, {"username": "Quacky McDuckerson", "date": "01 Apr 2020, 09:39", "content": "A fine tale!  <img alt=\":toppa:\" class=\"smilies\" src=\"./images/smilies/5.gif\" title=\"Toppa\"/>"}, {"username": "Chip Cobb", "date": "01 Apr 2020, 09:41", "content": "Bravo  <img alt=\":toppa:\" class=\"smilies\" src=\"./images/smilies/5.gif\" title=\"Toppa\"/>"}, {"username": "Valencia", "date": "01 Apr 2020, 09:43", "content": "Fuck me just read part 10 with Escape 700 by the Chemical Brothers playing on random play on Spotify, really added to the tension  <img alt=\":uhoh:\" class=\"smilies\" src=\"./images/smilies/icon_uhoh.gif\" title=\"Uh oh\"/> <img alt=\":lol:\" class=\"smilies\" src=\"./images/smilies/icon_lol.gif\" title=\"lol\"/><br/><br/>Edit: the ending with room for a sequel  <img alt=\":adore:\" class=\"smilies\" src=\"./images/smilies/adore.gif\" title=\"Adore\"/> <br/><br/>BTW what was the thing you thought forummers would hate you for?"}, {"username": "beefheart", "date": "01 Apr 2020, 09:46", "content": "Wonderful stuff  <img alt=\":adore:\" class=\"smilies\" src=\"./images/smilies/adore.gif\" title=\"Adore\"/> <img alt=\":toppa:\" class=\"smilies\" src=\"./images/smilies/5.gif\" title=\"Toppa\"/>"}, {"username": "Cachonding Hispalis", "date": "01 Apr 2020, 09:47", "content": "Brilliant work Snapper, a joy from start to finish.  <img alt=\":adore:\" class=\"smilies\" src=\"./images/smilies/adore.gif\" title=\"Adore\"/>"}, {"username": "Slick Rick", "date": "01 Apr 2020, 09:48", "content": "Great story. Shame you didn't get any pictures of the room full of bees. Would have liked to have seen that."}, {"username": "justme2009", "date": "01 Apr 2020, 09:50", "content": "Great story, great ending , thanks for posting it  <img alt=\":toppa:\" class=\"smilies\" src=\"./images/smilies/5.gif\" title=\"Toppa\"/>"}, {"username": "bluenewt", "date": "01 Apr 2020, 09:52", "content": "Mark <img alt=\":adore:\" class=\"smilies\" src=\"./images/smilies/adore.gif\" title=\"Adore\"/> <br/><br/>Wonderful stuff, decent sized hive in there in the end then <img alt=\":lol:\" class=\"smilies\" src=\"./images/smilies/icon_lol.gif\" title=\"lol\"/>"}, {"username": "OperationGoodisonExercise", "date": "01 Apr 2020, 09:53", "content": "Thanks for clarifying on whether you were stang<br/><br/>Enjoyed this - good forumming  <img alt=\":toppa:\" class=\"smilies\" src=\"./images/smilies/5.gif\" title=\"Toppa\"/>"}, {"username": "Geoff", "date": "01 Apr 2020, 09:53", "content": "<blockquote><div><cite>Snapper wrote:</cite><br/>“Was it a living colony, the one in my wall?” I asked, thinking about what the first beekeeper had said. <br/><br/>“Oh yeah” said Mark, “definitely”.<br/><br/>“So did you get the queen then?” I asked.<br/><br/>“No,” he said. “We never did find her”.<br/><br/>He got into his Ford Ranger and drove out of my life.<br/><br/></div></blockquote><br/><br/> <img alt=\":shocked:\" class=\"smilies\" src=\"./images/smilies/icon_eek.gif\" title=\"Shocked\"/> <img alt=\":shocked:\" class=\"smilies\" src=\"./images/smilies/icon_eek.gif\" title=\"Shocked\"/> <img alt=\":scared:\" class=\"smilies\" src=\"./images/smilies/scared.png\" title=\"Scared\"/> <br/><br/>Though really, she's not going to build a new colony by herself is she?"}, {"username": "Completely Pogued", "date": "01 Apr 2020, 09:58", "content": "<blockquote><div><cite>Valencia wrote:</cite>Fuck me just read part 10 with Escape 700 by the Chemical Brothers playing on random play on Spotify, really added to the tension  <img alt=\":uhoh:\" class=\"smilies\" src=\"./images/smilies/icon_uhoh.gif\" title=\"Uh oh\"/> <img alt=\":lol:\" class=\"smilies\" src=\"./images/smilies/icon_lol.gif\" title=\"lol\"/><br/><br/>Edit: the ending with room for a sequel  <img alt=\":adore:\" class=\"smilies\" src=\"./images/smilies/adore.gif\" title=\"Adore\"/> <br/><br/>BTW what was the thing you thought forummers would hate you for?</div></blockquote><br/><br/>City fan."}, {"username": "Arsene's Wanger", "date": "01 Apr 2020, 09:59", "content": "Enjoying this <img alt=\":p\" class=\"smilies\" src=\"./images/smilies/icon_razz.gif\" title=\"Razz\"/>"}, {"username": "Ninjacuts", "date": "01 Apr 2020, 10:00", "content": "Mark <img alt=\":smug:\" class=\"smilies\" src=\"./images/smilies/icon_smug.gif\" title=\"Smug\"/> <br/><br/>I knew the young lad would come through <img alt=\":adore:\" class=\"smilies\" src=\"./images/smilies/adore.gif\" title=\"Adore\"/>"}, {"username": "Bert Bertstofferson", "date": "01 Apr 2020, 10:00", "content": "<blockquote><div><cite>Snapper wrote:</cite>“So did you get the queen then?” I asked.<br/><br/>“No,” he said. “We never did find her”.<br/></div></blockquote><br/><br/><div style=\"padding: 1px; font-size: 1em;\"><div style=\"text-transform: uppercase; border-bottom: 1px solid #CCCCCC; margin-bottom: 0px; font-size: 0.8em; font-weight: bold; display: block;\"><span onclick=\"if (this.parentNode.parentNode.getElementsByTagName('div')[1].getElementsByTagName('div')[0].style.display != '') {  this.parentNode.parentNode.getElementsByTagName('div')[1].getElementsByTagName('div')[0].style.display = ''; this.innerHTML = '&lt;b&gt;Spoiler: &lt;/b&gt;&lt;a href=\\'#\\' onclick=\\'return false;\\'&gt;hide&lt;/a&gt;'; } else { this.parentNode.parentNode.getElementsByTagName('div')[1].getElementsByTagName('div')[0].style.display = 'none'; this.innerHTML = '&lt;b&gt;Spoiler: &lt;/b&gt;&lt;a href=\\'#\\' onclick=\\'return false;\\'&gt;show&lt;/a&gt;'; }\"></span><b>Spoiler: </b><a href=\"#\" onclick=\"return false;\">show</a></div></div>"}, {"username": "Darth Sillyus", "date": "01 Apr 2020, 10:01", "content": "<blockquote><div><cite>Geoff wrote:</cite><blockquote><div><cite>Snapper wrote:</cite><br/>“Was it a living colony, the one in my wall?” I asked, thinking about what the first beekeeper had said. <br/><br/>“Oh yeah” said Mark, “definitely”.<br/><br/>“So did you get the queen then?” I asked.<br/><br/>“No,” he said. “We never did find her”.<br/><br/>He got into his Ford Ranger and drove out of my life.<br/><br/></div></blockquote><br/><br/> <img alt=\":shocked:\" class=\"smilies\" src=\"./images/smilies/icon_eek.gif\" title=\"Shocked\"/> <img alt=\":shocked:\" class=\"smilies\" src=\"./images/smilies/icon_eek.gif\" title=\"Shocked\"/> <img alt=\":scared:\" class=\"smilies\" src=\"./images/smilies/scared.png\" title=\"Scared\"/> <br/><br/>Though really, she's not going to build a new colony by herself is she?</div></blockquote><br/><br/>Isn't that exactly what they do?"}, {"username": "bluenewt", "date": "01 Apr 2020, 10:03", "content": "Nah, they needs drones and workers to establish a colony stupid!<br/><br/>(I just looked this up)"}, {"username": "Grifter", "date": "01 Apr 2020, 10:05", "content": "Mark  <img alt=\":adore:\" class=\"smilies\" src=\"./images/smilies/adore.gif\" title=\"Adore\"/> <br/><br/>A cracking yarn, Snaps, with lovely delivery  <img alt=\":toppa:\" class=\"smilies\" src=\"./images/smilies/5.gif\" title=\"Toppa\"/>"}, {"username": "links", "date": "01 Apr 2020, 10:11", "content": "<img alt=\":adore:\" class=\"smilies\" src=\"./images/smilies/adore.gif\" title=\"Adore\"/>"}, {"username": "Chapman Baxter", "date": "01 Apr 2020, 10:11", "content": "A highly enjoyable read<br/><br/>Snapper  <img alt=\":thumbup:\" class=\"smilies\" src=\"./images/smilies/icon_thumbsup.gif\" title=\"Thumb Up\"/>"}, {"username": "Mujo", "date": "01 Apr 2020, 10:12", "content": "Beeravo."}, {"username": "spurt billy", "date": "01 Apr 2020, 10:12", "content": "Amazing, had me hooked from cover to cover  <img alt=\":adore:\" class=\"smilies\" src=\"./images/smilies/adore.gif\" title=\"Adore\"/> <br/>Dat honeycomb too  <img alt=\":p\" class=\"smilies\" src=\"./images/smilies/icon_razz.gif\" title=\"Razz\"/>"}, {"username": "The Wookie", "date": "01 Apr 2020, 10:14", "content": "thanks for taking the time Snapper  <img alt=\":toppa:\" class=\"smilies\" src=\"./images/smilies/5.gif\" title=\"Toppa\"/> <img alt=\":adore:\" class=\"smilies\" src=\"./images/smilies/adore.gif\" title=\"Adore\"/>"}, {"username": "Smith 9", "date": "01 Apr 2020, 10:14", "content": "OP, that was just brilliant from start to finish <img alt=\":toppa:\" class=\"smilies\" src=\"./images/smilies/5.gif\" title=\"Toppa\"/>"}, {"username": "Snapper", "date": "01 Apr 2020, 10:15", "content": "<blockquote><div><cite>Completely Pogued wrote:</cite><blockquote><div><cite>Valencia wrote:</cite>Fuck me just read part 10 with Escape 700 by the Chemical Brothers playing on random play on Spotify, really added to the tension  <img alt=\":uhoh:\" class=\"smilies\" src=\"./images/smilies/icon_uhoh.gif\" title=\"Uh oh\"/> <img alt=\":lol:\" class=\"smilies\" src=\"./images/smilies/icon_lol.gif\" title=\"lol\"/><br/><br/>Edit: the ending with room for a sequel  <img alt=\":adore:\" class=\"smilies\" src=\"./images/smilies/adore.gif\" title=\"Adore\"/> <br/><br/>BTW what was the thing you thought forummers would hate you for?</div></blockquote><br/><br/>City fan.</div></blockquote><br/><br/>Indeed.<br/><br/>I'm glad so many people enjoyed reading it, thanks for all the feedback. I very much enjoyed writing it  <img alt=\":toppa:\" class=\"smilies\" src=\"./images/smilies/5.gif\" title=\"Toppa\"/> <br/><br/>The queen was somewhat of a red herring tbf. As has been said, even if she is still in there somewhere, she won't have much joy establishing a new colony without any drones or workers. At the same time, it felt like the right thing to end the story with a... wait for it... sting in the tail. It also left things open for a sequel (I really hope there is no sequel)."}, {"username": "SuperTomasRepka", "date": "01 Apr 2020, 10:20", "content": "Bee-rilliant.<br/><br/>Some of the best writing hive read on here <img alt=\":thumbup:\" class=\"smilies\" src=\"./images/smilies/icon_thumbsup.gif\" title=\"Thumb Up\"/><br/><br/>Can we see some more pictures of the house? <img alt=\":o\" class=\"smilies\" src=\"./images/smilies/icon_surprised.gif\" title=\"Surprised\"/>"}, {"username": "Bingoa", "date": "01 Apr 2020, 10:22", "content": "Great read.  <img alt=\":toppa:\" class=\"smilies\" src=\"./images/smilies/5.gif\" title=\"Toppa\"/> <br/><br/>We had bees in our bay window ceiling when we bought the house. Had to replace the ceiling and roof. A total pain in the arse but none of the drama of your story.  <img alt=\":scared:\" class=\"smilies\" src=\"./images/smilies/scared.png\" title=\"Scared\"/>"}, {"username": "KBS", "date": "01 Apr 2020, 10:29", "content": "This is the pinnacle of your forum career Snappy.  Your Magnum Opus if you will.<br/><br/>Bravo sir.  Bravo  <img alt=\":toppa:\" class=\"smilies\" src=\"./images/smilies/5.gif\" title=\"Toppa\"/> <br/><br/>Bees  <img alt=\":adore:\" class=\"smilies\" src=\"./images/smilies/adore.gif\" title=\"Adore\"/>"}, {"username": "Dust Puppy", "date": "01 Apr 2020, 10:36", "content": "enjoyed that.  Thanks Snapper"}, {"username": "PostmanPhat", "date": "01 Apr 2020, 10:43", "content": "Enjoyed that. Hope we get more of these long reads of seemingly dull vignettes of forummers lives now we're all sat around doing fuck all.."}, {"username": "Poboy", "date": "01 Apr 2020, 10:44", "content": "A great tale. Well played, fella."}, {"username": "KBS", "date": "01 Apr 2020, 10:45", "content": "<blockquote><div><cite>Poboy wrote:</cite>A great tale. Well played, fella.</div></blockquote><br/><br/> <img alt=\":shocked:\" class=\"smilies\" src=\"./images/smilies/icon_eek.gif\" title=\"Shocked\"/>"}, {"username": "I like traffic lights", "date": "01 Apr 2020, 12:32", "content": "Even as we speak the Queen is planning her revenge, tunneling through the walls Andy dufresne style to make an entrance for new drones and workers to join her.<br/>Then we can have Bee Story 2: The Revenge of Buzz. Well snapper doesn't want that but I'm sure we'd all enjoy that (sorry snapper)"}, {"username": "milomak", "date": "01 Apr 2020, 12:51", "content": "wonderful story  <img alt=\":toppa:\" class=\"smilies\" src=\"./images/smilies/5.gif\" title=\"Toppa\"/>"}, {"username": "coppiceman", "date": "01 Apr 2020, 12:53", "content": "Tremendous  <img alt=\":adore:\" class=\"smilies\" src=\"./images/smilies/adore.gif\" title=\"Adore\"/>"}, {"username": "KingIcarus", "date": "01 Apr 2020, 13:06", "content": "Great stuff.  <img alt=\":adore:\" class=\"smilies\" src=\"./images/smilies/adore.gif\" title=\"Adore\"/><br/><br/>I used to work with a guy who kept bees with his dad as a kid. We were having a pint once when we bumped into a mate of his dad. This doesn't involve Andy. <br/><br/>The mate asked my pal in a hushed tone more akin to the negotiation of a crack deal, 'Tell me John. Are you still keeping?'<br/><br/>Still makes me smile to this day."}, {"username": "Dire on tour", "date": "01 Apr 2020, 13:25", "content": "That was a great read Snapper, plus I'm very jealous of your house  <img alt=\":sulk:\" class=\"smilies\" src=\"./images/smilies/1.gif\" title=\"Sulk\"/>"}, {"username": "I am Webb.", "date": "01 Apr 2020, 13:37", "content": "top work that man, paced just right in the end.  <img alt=\":toppa:\" class=\"smilies\" src=\"./images/smilies/5.gif\" title=\"Toppa\"/> <br/><br/>Mark <img alt=\":adore:\" class=\"smilies\" src=\"./images/smilies/adore.gif\" title=\"Adore\"/>"}, {"username": "Lad O'Banter", "date": "01 Apr 2020, 13:39", "content": "<img alt=\":toppa:\" class=\"smilies\" src=\"./images/smilies/5.gif\" title=\"Toppa\"/>"}, {"username": "superkev", "date": "01 Apr 2020, 13:53", "content": "Magnificent. Thanks for that  <img alt=\":adore:\" class=\"smilies\" src=\"./images/smilies/adore.gif\" title=\"Adore\"/>"}, {"username": "Chester J Lampwick", "date": "01 Apr 2020, 14:11", "content": "Top, top poster  <img alt=\":toppa:\" class=\"smilies\" src=\"./images/smilies/5.gif\" title=\"Toppa\"/>"}, {"username": "neville's 2 weeks", "date": "01 Apr 2020, 14:19", "content": "Enjoyed that - properly laughed at some points.<br/><br/>Fair fucks to Mark too - proper star!<br/><br/><br/>Thanks Snapper."}, {"username": "jimmygrimble", "date": "01 Apr 2020, 14:29", "content": "Enjoyed that. Thanks for sharing, snapper. You're a talented writer, make no mistake!"}, {"username": "daishy", "date": "01 Apr 2020, 15:00", "content": "<blockquote><div><cite>Fundamentals wrote:</cite>A great ending to this story will make all the mediocre writing and superfluous chapters worth it. Bring it home OP.</div></blockquote><br/>Says the pretend teacher who fucked off to China in the hope of getting a ride. <br/><br/>Cracking read OP, well done. Marvelous ending too.  <img alt=\":thumbup:\" class=\"smilies\" src=\"./images/smilies/icon_thumbsup.gif\" title=\"Thumb Up\"/> <br/><br/>Mark.  <img alt=\":adore:\" class=\"smilies\" src=\"./images/smilies/adore.gif\" title=\"Adore\"/> <img alt=\":adore:\" class=\"smilies\" src=\"./images/smilies/adore.gif\" title=\"Adore\"/>"}, {"username": "Richard Keys' keys", "date": "01 Apr 2020, 15:36", "content": "Snapper <img alt=\":adore:\" class=\"smilies\" src=\"./images/smilies/adore.gif\" title=\"Adore\"/><br/><br/>Deserves a name change to Stinger"}, {"username": "Bacon Sarnie", "date": "01 Apr 2020, 16:00", "content": "Excellent thread. Thanks Snapper!  <img alt=\":adore:\" class=\"smilies\" src=\"./images/smilies/adore.gif\" title=\"Adore\"/> <img alt=\":toppa:\" class=\"smilies\" src=\"./images/smilies/5.gif\" title=\"Toppa\"/>"}, {"username": "laertes", "date": "01 Apr 2020, 16:05", "content": "What a brilliant story  <img alt=\":adore:\" class=\"smilies\" src=\"./images/smilies/adore.gif\" title=\"Adore\"/> <img alt=\":adore:\" class=\"smilies\" src=\"./images/smilies/adore.gif\" title=\"Adore\"/> Laughed my head off throughout, and also at thread contributions, especially this one.<br/><br/><blockquote><div><cite>CarTree wrote:</cite>I hope your wife put “some bees” on her list for the lols</div></blockquote><br/><br/>Can't wait for the beequel.  <img alt=\":adore:\" class=\"smilies\" src=\"./images/smilies/adore.gif\" title=\"Adore\"/>"}, {"username": "Snapper", "date": "01 Apr 2020, 16:25", "content": "<blockquote><div><cite>Dire on tour wrote:</cite>That was a great read Snapper, plus I'm very jealous of your house  <img alt=\":sulk:\" class=\"smilies\" src=\"./images/smilies/1.gif\" title=\"Sulk\"/></div></blockquote><br/><br/>It's a unique place, no doubt about it. But it's a daunting thing to own such an old property, we spent thousands on surveys and still have had a ton of unforeseen problems arise (the bees being one of the cheaper and more entertaining ones to resolve)."}, {"username": "Count Frederico", "date": "01 Apr 2020, 16:36", "content": "That was great!  Did the original bee-keeper ever get back in contact?"}, {"username": "Yack", "date": "01 Apr 2020, 16:56", "content": "Thoroughly enjoyed that tale  <img alt=\":thumbup:\" class=\"smilies\" src=\"./images/smilies/icon_thumbsup.gif\" title=\"Thumb Up\"/>"}, {"username": "Snapper", "date": "01 Apr 2020, 17:04", "content": "<blockquote><div><cite>Count Frederico wrote:</cite>That was great!  Did the original bee-keeper ever get back in contact?</div></blockquote><br/><br/>Yeah he called in a few months later to get the bees. I told him they were gone. He started whining about how it was unfair cos he had \"dibs\"."}, {"username": "ironmike8", "date": "01 Apr 2020, 17:07", "content": "<blockquote><div><cite>Snapper wrote:</cite><blockquote><div><cite>Count Frederico wrote:</cite>That was great!  Did the original bee-keeper ever get back in contact?</div></blockquote><br/><br/>Yeah he called in a few months later to get the bees. I told him they were gone. He started whining about how it was unfair cos he had \"dibs\".</div></blockquote><br/>I feel like you should tell the Bee Keeping Association about Mark and how much better he was than this guy<br/><br/>Top thread, cheers  <img alt=\":toppa:\" class=\"smilies\" src=\"./images/smilies/5.gif\" title=\"Toppa\"/>"}, {"username": "milomak", "date": "01 Apr 2020, 17:33", "content": "<blockquote><div><cite>Snapper wrote:</cite><blockquote><div><cite>Count Frederico wrote:</cite>That was great!  Did the original bee-keeper ever get back in contact?</div></blockquote><br/><br/>Yeah he called in a few months later to get the bees. I told him they were gone. He started whining about how it was unfair cos he had \"dibs\".</div></blockquote><br/>you can't be serious <img alt=\":lol:\" class=\"smilies\" src=\"./images/smilies/icon_lol.gif\" title=\"lol\"/>"}, {"username": "jahoran", "date": "01 Apr 2020, 19:06", "content": "<img alt=\":toppa:\" class=\"smilies\" src=\"./images/smilies/5.gif\" title=\"Toppa\"/> <br/><br/>Fair play to you for not exterminating them all"}, {"username": "supermonkey", "date": "01 Apr 2020, 19:08", "content": "This was a great read, thanks"}, {"username": "TheTooter", "date": "01 Apr 2020, 19:35", "content": "Great stuff, thanks snapper"}, {"username": "KBS", "date": "02 Apr 2020, 03:40", "content": "I think this needs to be moved to Classics tbf.<br/><br/>Easy to find again for future generations (lol) of the forum  <img alt=\":toppa:\" class=\"smilies\" src=\"./images/smilies/5.gif\" title=\"Toppa\"/>"}, {"username": "Snapper", "date": "02 Apr 2020, 05:49", "content": "<blockquote><div><cite>milomak wrote:</cite><blockquote><div><cite>Snapper wrote:</cite><blockquote><div><cite>Count Frederico wrote:</cite>That was great!  Did the original bee-keeper ever get back in contact?</div></blockquote><br/><br/>Yeah he called in a few months later to get the bees. I told him they were gone. He started whining about how it was unfair cos he had \"dibs\".</div></blockquote><br/>you can't be serious <img alt=\":lol:\" class=\"smilies\" src=\"./images/smilies/icon_lol.gif\" title=\"lol\"/></div></blockquote><br/><br/>Correct. I never heard from beekeeper 1 again. Remember, he didn't think there were many bees in my house. I believe if he'd known how many there were, he would have been far keener to get involved. <br/><br/>Wild bees are highly prized seemingly. I didn't say so in the story but the Facebook post I made actually had loads of replies from people, tagging their beekeeper friends. I had to take the post down in the end because I was getting inundated with people asking if they could have the bees. <br/><br/>I chose Mark because he seemed like a nice young man (and I was proved right) but I had plenty of suitors once I went on Facebook."}, {"username": "Jebus", "date": "02 Apr 2020, 06:18", "content": "I'm considering getting into beekeeping when this is all over and done with.<br/>The plan is to install pollytunnells &amp; grow veg outside. Also looking to convert one of my sheds into a microbrewery...... Would make be hive minded do you know?"}, {"username": "A Tugay Substitution", "date": "02 Apr 2020, 06:37", "content": "Enjoyable stuff. <br/><br/>I'd love to hear the Bee's side of the story"}, {"username": "Snapper", "date": "02 Apr 2020, 07:04", "content": "<blockquote><div><cite>A Tugay Substitution wrote:</cite>Enjoyable stuff. <br/><br/>I'd love to hear the Bee's side of the story</div></blockquote><br/><br/>There's probably a Buzzfeed article about it."}, {"username": "Dissolved", "date": "02 Apr 2020, 07:16", "content": "Lovely stuff, a splendid effort. <br/><br/>Who knew we all needed this? <br/><br/>The scene in the bedroom had me shook  <img alt=\":scared:\" class=\"smilies\" src=\"./images/smilies/scared.png\" title=\"Scared\"/>"}, {"username": "humungojerry", "date": "02 Apr 2020, 07:18", "content": "<blockquote><div><cite>justme2009 wrote:</cite><blockquote><div><cite>Ari wrote:</cite>The high pitched buzzing would drive me insane, my skin crawls just thinking of it. Takes a braver man than me to put up with the Cork accent full time</div></blockquote><br/><br/> <img alt=\":lol:\" class=\"smilies\" src=\"./images/smilies/icon_lol.gif\" title=\"lol\"/></div></blockquote><br/><br/> <img alt=\":lol:\" class=\"smilies\" src=\"./images/smilies/icon_lol.gif\" title=\"lol\"/> <img alt=\":adore:\" class=\"smilies\" src=\"./images/smilies/adore.gif\" title=\"Adore\"/>"}, {"username": "Slothbadger", "date": "02 Apr 2020, 07:48", "content": "That was absolutely wonderful.  <img alt=\":toppa:\" class=\"smilies\" src=\"./images/smilies/5.gif\" title=\"Toppa\"/>"}, {"username": "Snapper", "date": "02 Apr 2020, 08:20", "content": "Some people had asked for some more photos of the house so I've chucked a few up in case anyone is interested.<br/><br/>This is the kitchen (photo was taken the night we got the keys in Dec 2018). Although I'm not mad about the floor tiles here, it's in pretty good shape, so all we've done there is paint the walls and ceiling (the beams are painted black now), and replaced the handles on the drawers and presses.<br/><br/><div style=\"padding: 1px; font-size: 1em;\"><div style=\"text-transform: uppercase; border-bottom: 1px solid #CCCCCC; margin-bottom: 0px; font-size: 0.8em; font-weight: bold; display: block;\"><span onclick=\"if (this.parentNode.parentNode.getElementsByTagName('div')[1].getElementsByTagName('div')[0].style.display != '') {  this.parentNode.parentNode.getElementsByTagName('div')[1].getElementsByTagName('div')[0].style.display = ''; this.innerHTML = '&lt;b&gt;Spoiler: &lt;/b&gt;&lt;a href=\\'#\\' onclick=\\'return false;\\'&gt;hide&lt;/a&gt;'; } else { this.parentNode.parentNode.getElementsByTagName('div')[1].getElementsByTagName('div')[0].style.display = 'none'; this.innerHTML = '&lt;b&gt;Spoiler: &lt;/b&gt;&lt;a href=\\'#\\' onclick=\\'return false;\\'&gt;show&lt;/a&gt;'; }\"></span><b>Spoiler: </b><a href=\"#\" onclick=\"return false;\">show</a></div></div>"}, {"username": "SuperTomasRepka", "date": "02 Apr 2020, 08:29", "content": "Lovely stuff - thanks <img alt=\":toppa:\" class=\"smilies\" src=\"./images/smilies/5.gif\" title=\"Toppa\"/>"}, {"username": "Jebus", "date": "02 Apr 2020, 08:31", "content": "Not sure those dogs would do much damage tbf<br/>Still though, dat setup <img alt=\":poundit:\" class=\"smilies\" src=\"./images/smilies/3.gif\" title=\"pound it\"/>"}, {"username": "Farnsworth", "date": "02 Apr 2020, 08:44", "content": "Enjoyed that, well played  <img alt=\":thumbup:\" class=\"smilies\" src=\"./images/smilies/icon_thumbsup.gif\" title=\"Thumb Up\"/>"}, {"username": "Snapper", "date": "02 Apr 2020, 08:54", "content": "<blockquote><div><cite>Jebus wrote:</cite>Not sure those dogs would do much damage tbf</div></blockquote><br/><br/>Well maybe I'll release the bees? Or the dogs with bees in their mouth and when they bark they shoot bees at you?"}, {"username": "daishy", "date": "02 Apr 2020, 08:56", "content": "Alright, now you're just showing off.  <img alt=\":wave:\" class=\"smilies\" src=\"./images/smilies/wave_smiley.gif\" title=\"Wave\"/>"}, {"username": "FattyMc", "date": "02 Apr 2020, 11:00", "content": "Snapper <img alt=\":adore:\" class=\"smilies\" src=\"./images/smilies/adore.gif\" title=\"Adore\"/> fantastic story. I was a bit behind and planned to read a couple of parts a day, but your writing style was so good I binged it all in one <img alt=\":lol:\" class=\"smilies\" src=\"./images/smilies/icon_lol.gif\" title=\"lol\"/> <img alt=\":proud:\" class=\"smilies\" src=\"./images/smilies/icon_proud.gif\" title=\"Proud\"/>"}, {"username": "milomak", "date": "02 Apr 2020, 11:48", "content": "i feel a layout of the house drawn in ms paint would be helpful here"}, {"username": "theabbeyrabbit", "date": "02 Apr 2020, 12:00", "content": "Lovely stuff. I enjoyed all that  <img alt=\":thumbup:\" class=\"smilies\" src=\"./images/smilies/icon_thumbsup.gif\" title=\"Thumb Up\"/> <br/>But particularly this bit:<br/><br/><blockquote class=\"uncited\"><div>I needed to cover my tracks, so the first thing I did was set up a fake Facebook profile. I used a name I had been using as an alias for a while, taken from a sushi menu I’d seen in Tokyo. Once that was done, I signed Jack Mackerel up to a few local notice boards and posted about the problem. Amongst the many hilarious but not particularly helpful replies - “I hope it doesn’t cost too much to fix, as I’ve heard of people getting STUNG”, “Lots of BUZZ about this kind of thing at the moment”, <strong>“Stupid bee wanker” (that last one was posted by me from my actual FB profile <img alt=\":smug:\" class=\"smilies\" src=\"./images/smilies/icon_smug.gif\" title=\"Smug\"/> )</strong> - there was one promising post from a guy named Mark</div></blockquote><br/><br/> <img alt=\":lol:\" class=\"smilies\" src=\"./images/smilies/icon_lol.gif\" title=\"lol\"/>"}, {"username": "CBlue", "date": "02 Apr 2020, 12:35", "content": "Tbf, I was a little disappointed as I thought this may be an elaborate April fools joke. Turns out to be a very cool story.  <img alt=\":toppa:\" class=\"smilies\" src=\"./images/smilies/5.gif\" title=\"Toppa\"/>"}, {"username": "Mini", "date": "02 Apr 2020, 13:20", "content": "<blockquote><div><cite>Snapper wrote:</cite><img alt=\"Image\" class=\"postimage\" src=\"https://i.imgur.com/socvYNe.jpg\"/><br/></div></blockquote><br/><br/>Can the sequel bee about the body under the sheets here? <img alt=\":uhoh:\" class=\"smilies\" src=\"./images/smilies/icon_uhoh.gif\" title=\"Uh oh\"/> <br/><br/>Also your house is awesome!"}, {"username": "Snapper", "date": "02 Apr 2020, 13:27", "content": "<blockquote><div><cite>milomak wrote:</cite>i feel a layout of the house drawn in ms paint would be helpful here</div></blockquote><br/><br/>If you're a competent draughtsman, you're more than welcome to come over and try draw the layout. I've tried on more than one occasion as floorplans would be very useful to have but the unorthodox nature of the place has always defeated me."}, {"username": "Toastface Chillah", "date": "02 Apr 2020, 15:30", "content": "I kept seeing this thread for the last few days and never opened it until earlier this evening for some reason. A fantastic story, really well written. I enjoyed reading it.  <img alt=\":toppa:\" class=\"smilies\" src=\"./images/smilies/5.gif\" title=\"Toppa\"/> <br/><br/>You have a really nice house too. So much better than my cluttered hovel.   <img alt=\":lol:\" class=\"smilies\" src=\"./images/smilies/icon_lol.gif\" title=\"lol\"/> <br/><br/>I discovered a bumble bee hive in my lawn last year. I discovered it by putting my bare bee-slidered foot through it as I hung washing in the line and trapped one of them under my toes. Being stuck in the toe joint really hurts.  <img alt=\":picard:\" class=\"smilies\" src=\"./images/smilies/picard.gif\" title=\"Picard\"/>"}, {"username": "Yack", "date": "02 Apr 2020, 16:23", "content": "Move to Classics."}, {"username": "GOBluth", "date": "02 Apr 2020, 18:24", "content": "Great story and cracking house <img alt=\":adore:\" class=\"smilies\" src=\"./images/smilies/adore.gif\" title=\"Adore\"/> <br/><br/>One thing I will never understand is dog people, having 3 dogs lay on your bed after licking each others arses or whatever it is that dogs do  <img alt=\":dead:\" class=\"smilies\" src=\"./images/smilies/icon_dead.gif\" title=\"Dead\"/>"}, {"username": "PerryWonderland", "date": "02 Apr 2020, 18:32", "content": "<blockquote><div><cite>GOBluth wrote:</cite>Great story and cracking house <img alt=\":adore:\" class=\"smilies\" src=\"./images/smilies/adore.gif\" title=\"Adore\"/> <br/><br/>One thing I will never understand is dog people, having 3 dogs lay on your bed after licking each others arses or whatever it is that dogs do  <img alt=\":dead:\" class=\"smilies\" src=\"./images/smilies/icon_dead.gif\" title=\"Dead\"/></div></blockquote><br/>Agreed on both counts, I'd rather have the bees on my bed than three dogs.<br/><br/>Great story  <img alt=\":toppa:\" class=\"smilies\" src=\"./images/smilies/5.gif\" title=\"Toppa\"/>"}, {"username": "Ron Jeremy", "date": "02 Apr 2020, 18:41", "content": "Top work, move to classics, get on it acorns  <img alt=\":toppa:\" class=\"smilies\" src=\"./images/smilies/5.gif\" title=\"Toppa\"/> <img alt=\":toppa:\" class=\"smilies\" src=\"./images/smilies/5.gif\" title=\"Toppa\"/>"}, {"username": "Geoff", "date": "02 Apr 2020, 18:59", "content": "Lovely gaff there mate. Would be happy to live there."}, {"username": "Snapper", "date": "02 Apr 2020, 19:21", "content": "<blockquote><div><cite>GOBluth wrote:</cite>Great story and cracking house <img alt=\":adore:\" class=\"smilies\" src=\"./images/smilies/adore.gif\" title=\"Adore\"/> <br/><br/>One thing I will never understand is dog people, having 3 dogs lay on your bed after licking each others arses or whatever it is that dogs do  <img alt=\":dead:\" class=\"smilies\" src=\"./images/smilies/icon_dead.gif\" title=\"Dead\"/></div></blockquote><br/><br/>Well they aren't allowed to be on the bed tbf. The boy is always sneaking up there though, I need to watch him like a hawk. The photo with the 3 of them was just before I changed the sheets so  :shrug:<br/><br/>Dogs are great, it's a small price to pay for the love and companionship they give."}, {"username": "Snapper", "date": "02 Apr 2020, 19:32", "content": "<blockquote><div><cite>Geoff wrote:</cite>Lovely gaff there mate. Would be happy to live there.</div></blockquote><br/><br/>Cheers Geoff, it means a lot coming Frome you (see what I did there?)"}, {"username": "Tokyo Sexwhale", "date": "02 Apr 2020, 19:34", "content": "<blockquote><div><cite>Snapper wrote:</cite><blockquote><div><cite>GOBluth wrote:</cite>Great story and cracking house <img alt=\":adore:\" class=\"smilies\" src=\"./images/smilies/adore.gif\" title=\"Adore\"/> <br/><br/>One thing I will never understand is dog people, having 3 dogs lay on your bed after licking each others arses or whatever it is that dogs do  <img alt=\":dead:\" class=\"smilies\" src=\"./images/smilies/icon_dead.gif\" title=\"Dead\"/></div></blockquote><br/><br/>Well they aren't allowed to be on the bed tbf. The boy is always sneaking up there though, I need to watch him like a hawk. The photo with the 3 of them was just before I changed the sheets so  :shrug:<br/><br/>Dogs are great, it's a small price to pay for the love and companionship they give.</div></blockquote><br/><br/>Giving them mixed messages there. They don't understand about special exemptions of just before you change the sheets.  Either it's ok to get on the bed, or it isn't."}, {"username": "Snapper", "date": "02 Apr 2020, 19:48", "content": "Yes, you are correct. They're not encouraged to be on the bed, nor do they get rewarded. I found them on the bed and took a photo, then they were told to get off the bed, which they did. I then changed the sheets.<br/><br/>They're good dogs Brent."}, {"username": "ironmike8", "date": "02 Apr 2020, 20:03", "content": "What a fucking house  <img alt=\":adore:\" class=\"smilies\" src=\"./images/smilies/adore.gif\" title=\"Adore\"/> <br/><br/>You should get a ride on mower. Totally justifiable imo  <img alt=\":nod:\" class=\"smilies\" src=\"./images/smilies/icon_nod.gif\" title=\"Nod\"/>"}, {"username": "Nichael Bluth", "date": "02 Apr 2020, 20:12", "content": "<blockquote><div><cite>Yack wrote:</cite>Move to Classics.</div></blockquote><br/><br/>Will do this once everyone's done  <img alt=\":toppa:\" class=\"smilies\" src=\"./images/smilies/5.gif\" title=\"Toppa\"/>"}, {"username": "Lolhurst", "date": "03 Apr 2020, 10:38", "content": "The OP is George R. R. Martin, isn't he?"}, {"username": "bluenewt", "date": "03 Apr 2020, 10:44", "content": "Nah, he finished."}, {"username": "Marc Rombi", "date": "03 Apr 2020, 10:49", "content": "<blockquote><div><cite>Snapper wrote:</cite><blockquote><div><cite>Count Frederico wrote:</cite>That was great!  Did the original bee-keeper ever get back in contact?</div></blockquote><br/><br/>Yeah he called in a few months later to get the bees. I told him they were gone. He started whining about how it was unfair cos he had \"dibs\".</div></blockquote><br/><br/>What an entitled CNut like!<br/><br/>Great read !"}, {"username": "Snapper", "date": "03 Apr 2020, 12:22", "content": "<blockquote><div><cite>Lolhurst wrote:</cite>The OP is George R. R. Martin, isn't he?</div></blockquote><br/><br/>Game of Drones  <img alt=\"8-)\" class=\"smilies\" src=\"./images/smilies/icon_cool.gif\" title=\"Cool\"/>"}, {"username": "Frozen Gold", "date": "03 Apr 2020, 16:54", "content": "Fantastic forumming Snapper, I really enjoyed the story. Thanks for sharing.<br/>Mark  <img alt=\":adore:\" class=\"smilies\" src=\"./images/smilies/adore.gif\" title=\"Adore\"/>"}, {"username": "Mystery Plum", "date": "11 Apr 2020, 18:06", "content": "Great thread - top work OP <img alt=\":o\" class=\"smilies\" src=\"./images/smilies/icon_surprised.gif\" title=\"Surprised\"/><br/><br/>That first beekeeper - what a fucking wanker; turns up without ringing first, and then fucks off and doesn't get in touch again.  I hope all of his bees turn into wasps  <img alt=\":sulk:\" class=\"smilies\" src=\"./images/smilies/1.gif\" title=\"Sulk\"/>"}, {"username": "Ari", "date": "12 Apr 2020, 09:22", "content": "Related tweet<br/><br/><!-- m --><a class=\"postlink\" href=\"https://twitter.com/Reuters/status/1249321370774839303?s=19\">https://twitter.com/Reuters/status/1249 ... 39303?s=19</a><!-- m -->"}, {"username": "MessyKen", "date": "17 Apr 2020, 17:39", "content": "Cracking read  <img alt=\":thumbup:\" class=\"smilies\" src=\"./images/smilies/icon_thumbsup.gif\" title=\"Thumb Up\"/>"}, {"username": "MooCFC", "date": "18 Apr 2020, 03:34", "content": "This is a bm"}, {"username": "Janitor", "date": "25 Apr 2020, 02:01", "content": "Well that was a lovely read  <img alt=\":toppa:\" class=\"smilies\" src=\"./images/smilies/5.gif\" title=\"Toppa\"/>"}]